RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
typedef struct stc_exbus_area0_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area0_field_t;

typedef struct stc_exbus_area1_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area1_field_t;

typedef struct stc_exbus_area2_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area2_field_t;

typedef struct stc_exbus_area3_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area3_field_t;

typedef struct stc_exbus_area4_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area4_field_t;

typedef struct stc_exbus_area5_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area5_field_t;

typedef struct stc_exbus_area6_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area6_field_t;

typedef struct stc_exbus_area7_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area7_field_t;

typedef struct stc_exbus_atim0_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim0_field_t;

typedef struct stc_exbus_atim1_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim1_field_t;

typedef struct stc_exbus_atim2_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim2_field_t;

typedef struct stc_exbus_atim3_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim3_field_t;

typedef struct stc_exbus_atim4_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim4_field_t;

typedef struct stc_exbus_atim5_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim5_field_t;

typedef struct stc_exbus_atim6_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim6_field_t;

typedef struct stc_exbus_atim7_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim7_field_t;

typedef struct stc_exbus_dclkr_field
{
  __IO  uint8_t MDIV0      : 1;
  __IO  uint8_t MDIV1      : 1;
  __IO  uint8_t MDIV2      : 1;
  __IO  uint8_t MDIV3      : 1;
  __IO  uint8_t MCLKON     : 1;
} stc_exbus_dclkr_field_t;

