RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
typedef struct stc_ethernet_mac_tdlar_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t STL2       : 1;
  __IO uint32_t STL3       : 1;
  __IO uint32_t STL4       : 1;
  __IO uint32_t STL5       : 1;
  __IO uint32_t STL6       : 1;
  __IO uint32_t STL7       : 1;
  __IO uint32_t STL8       : 1;
  __IO uint32_t STL9       : 1;
  __IO uint32_t STL10      : 1;
  __IO uint32_t STL11      : 1;
  __IO uint32_t STL12      : 1;
  __IO uint32_t STL13      : 1;
  __IO uint32_t STL14      : 1;
  __IO uint32_t STL15      : 1;
  __IO uint32_t STL16      : 1;
  __IO uint32_t STL17      : 1;
  __IO uint32_t STL18      : 1;
  __IO uint32_t STL19      : 1;
  __IO uint32_t STL20      : 1;
  __IO uint32_t STL21      : 1;
  __IO uint32_t STL22      : 1;
  __IO uint32_t STL23      : 1;
  __IO uint32_t STL24      : 1;
  __IO uint32_t STL25      : 1;
  __IO uint32_t STL26      : 1;
  __IO uint32_t STL27      : 1;
  __IO uint32_t STL28      : 1;
  __IO uint32_t STL29      : 1;
  __IO uint32_t STL30      : 1;
  __IO uint32_t STL31      : 1;
} stc_ethernet_mac_tdlar_field_t;

typedef struct stc_ethernet_mac_sr_field
{
  __IO uint32_t TI         : 1;
  __IO uint32_t TPS        : 1;
  __IO uint32_t TU         : 1;
  __IO uint32_t TJT        : 1;
  __IO uint32_t OVF        : 1;
  __IO uint32_t UNF        : 1;
  __IO uint32_t RI         : 1;
  __IO uint32_t RU         : 1;
  __IO uint32_t RPS        : 1;
  __IO uint32_t RWT        : 1;
  __IO uint32_t ETI        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FBI        : 1;
  __IO uint32_t ERI        : 1;
  __IO uint32_t AIS        : 1;
  __IO uint32_t NIS        : 1;
  __IO uint32_t RS0        : 1;
  __IO uint32_t RS1        : 1;
  __IO uint32_t RS2        : 1;
  __IO uint32_t TS0        : 1;
  __IO uint32_t TS1        : 1;
  __IO uint32_t TS2        : 1;
  __IO uint32_t EB0        : 1;
  __IO uint32_t EB1        : 1;
  __IO uint32_t EB2        : 1;
  __IO uint32_t GLI        : 1;
  __IO uint32_t GMI        : 1;
  __IO uint32_t GPI        : 1;
  __IO uint32_t TTI        : 1;
  __IO uint32_t GLPII      : 1;
} stc_ethernet_mac_sr_field_t;

typedef struct stc_ethernet_mac_omr_field
{
       uint32_t RESERVED1  : 1;
  __IO uint32_t SR         : 1;
  __IO uint32_t OSF        : 1;
  __IO uint32_t RTC0       : 1;
  __IO uint32_t RTC1       : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t FUF        : 1;
  __IO uint32_t FEF        : 1;
       uint32_t RESERVED3  : 5;
  __IO uint32_t ST         : 1;
  __IO uint32_t TTC0       : 1;
  __IO uint32_t TTC1       : 1;
  __IO uint32_t TTC2       : 1;
       uint32_t RESERVED4  : 3;
  __IO uint32_t FTF        : 1;
  __IO uint32_t TSF        : 1;
       uint32_t RESERVED5  : 2;
  __IO uint32_t DFF        : 1;
  __IO uint32_t RSF        : 1;
  __IO uint32_t DT         : 1;
} stc_ethernet_mac_omr_field_t;

typedef struct stc_ethernet_mac_ier_field
{
  __IO uint32_t TIE        : 1;
  __IO uint32_t TSE        : 1;
  __IO uint32_t TUE        : 1;
  __IO uint32_t TJE        : 1;
  __IO uint32_t OVE        : 1;
  __IO uint32_t UNE        : 1;
  __IO uint32_t RIE        : 1;
  __IO uint32_t RUE        : 1;
  __IO uint32_t RSE        : 1;
  __IO uint32_t RWE        : 1;
  __IO uint32_t ETE        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FBE        : 1;
  __IO uint32_t ERE        : 1;
  __IO uint32_t AIE        : 1;
  __IO uint32_t NIE        : 1;
} stc_ethernet_mac_ier_field_t;

typedef struct stc_ethernet_mac_mfbocr_field
{
  __IO uint32_t NMFH0      : 1;
  __IO uint32_t NMFH1      : 1;
  __IO uint32_t NMFH2      : 1;
  __IO uint32_t NMFH3      : 1;
  __IO uint32_t NMFH4      : 1;
  __IO uint32_t NMFH5      : 1;
  __IO uint32_t NMFH6      : 1;
  __IO uint32_t NMFH7      : 1;
  __IO uint32_t NMFH8      : 1;
  __IO uint32_t NMFH9      : 1;
  __IO uint32_t NMFH10     : 1;
  __IO uint32_t NMFH11     : 1;
  __IO uint32_t NMFH12     : 1;
  __IO uint32_t NMFH13     : 1;
  __IO uint32_t NMFH14     : 1;
  __IO uint32_t NMFH15     : 1;
  __IO uint32_t ONMFH      : 1;
  __IO uint32_t NMFF0      : 1;
  __IO uint32_t NMFF1      : 1;
  __IO uint32_t NMFF2      : 1;
  __IO uint32_t NMFF3      : 1;
  __IO uint32_t NMFF4      : 1;
  __IO uint32_t NMFF5      : 1;
  __IO uint32_t NMFF6      : 1;
  __IO uint32_t NMFF7      : 1;
  __IO uint32_t NMFF8      : 1;
  __IO uint32_t NMFF9      : 1;
  __IO uint32_t NMFF10     : 1;
  __IO uint32_t ONMFF      : 1;
} stc_ethernet_mac_mfbocr_field_t;

typedef struct stc_ethernet_mac_riwtr_field
{
  __IO uint32_t RIWT0      : 1;
  __IO uint32_t RIWT1      : 1;
  __IO uint32_t RIWT2      : 1;
  __IO uint32_t RIWT3      : 1;
  __IO uint32_t RIWT4      : 1;
  __IO uint32_t RIWT5      : 1;
  __IO uint32_t RIWT6      : 1;
  __IO uint32_t RIWT7      : 1;
} stc_ethernet_mac_riwtr_field_t;

typedef struct stc_ethernet_mac_ahbsr_field
{
  __IO uint32_t AHBS       : 1;
} stc_ethernet_mac_ahbsr_field_t;

typedef struct stc_ethernet_mac_chtdr_field
{
  __IO uint32_t HTDAP0     : 1;
  __IO uint32_t HTDAP1     : 1;
  __IO uint32_t HTDAP2     : 1;
  __IO uint32_t HTDAP3     : 1;
  __IO uint32_t HTDAP4     : 1;
  __IO uint32_t HTDAP5     : 1;
  __IO uint32_t HTDAP6     : 1;
  __IO uint32_t HTDAP7     : 1;
  __IO uint32_t HTDAP8     : 1;
  __IO uint32_t HTDAP9     : 1;
  __IO uint32_t HTDAP10    : 1;
  __IO uint32_t HTDAP11    : 1;
  __IO uint32_t HTDAP12    : 1;
  __IO uint32_t HTDAP13    : 1;
  __IO uint32_t HTDAP14    : 1;
  __IO uint32_t HTDAP15    : 1;
  __IO uint32_t HTDAP16    : 1;
  __IO uint32_t HTDAP17    : 1;
  __IO uint32_t HTDAP18    : 1;
  __IO uint32_t HTDAP19    : 1;
  __IO uint32_t HTDAP20    : 1;
  __IO uint32_t HTDAP21    : 1;
  __IO uint32_t HTDAP22    : 1;
  __IO uint32_t HTDAP23    : 1;
  __IO uint32_t HTDAP24    : 1;
  __IO uint32_t HTDAP25    : 1;
  __IO uint32_t HTDAP26    : 1;
  __IO uint32_t HTDAP27    : 1;
  __IO uint32_t HTDAP28    : 1;
  __IO uint32_t HTDAP29    : 1;
  __IO uint32_t HTDAP30    : 1;
  __IO uint32_t HTDAP31    : 1;
} stc_ethernet_mac_chtdr_field_t;

typedef struct stc_ethernet_mac_chrdr_field
{
  __IO uint32_t HRDAP0     : 1;
  __IO uint32_t HRDAP1     : 1;
  __IO uint32_t HRDAP2     : 1;
  __IO uint32_t HRDAP3     : 1;
  __IO uint32_t HRDAP4     : 1;
  __IO uint32_t HRDAP5     : 1;
  __IO uint32_t HRDAP6     : 1;
  __IO uint32_t HRDAP7     : 1;
  __IO uint32_t HRDAP8     : 1;
  __IO uint32_t HRDAP9     : 1;
  __IO uint32_t HRDAP10    : 1;
  __IO uint32_t HRDAP11    : 1;
  __IO uint32_t HRDAP12    : 1;
  __IO uint32_t HRDAP13    : 1;
  __IO uint32_t HRDAP14    : 1;
  __IO uint32_t HRDAP15    : 1;
  __IO uint32_t HRDAP16    : 1;
  __IO uint32_t HRDAP17    : 1;
  __IO uint32_t HRDAP18    : 1;
  __IO uint32_t HRDAP19    : 1;
  __IO uint32_t HRDAP20    : 1;
  __IO uint32_t HRDAP21    : 1;
  __IO uint32_t HRDAP22    : 1;
  __IO uint32_t HRDAP23    : 1;
  __IO uint32_t HRDAP24    : 1;
  __IO uint32_t HRDAP25    : 1;
  __IO uint32_t HRDAP26    : 1;
  __IO uint32_t HRDAP27    : 1;
  __IO uint32_t HRDAP28    : 1;
  __IO uint32_t HRDAP29    : 1;
  __IO uint32_t HRDAP30    : 1;
  __IO uint32_t HRDAP31    : 1;
} stc_ethernet_mac_chrdr_field_t;

typedef struct stc_ethernet_mac_chtbar_field
{
  __IO uint32_t HTBAR0     : 1;
  __IO uint32_t HTBAR1     : 1;
  __IO uint32_t HTBAR2     : 1;
  __IO uint32_t HTBAR3     : 1;
  __IO uint32_t HTBAR4     : 1;
  __IO uint32_t HTBAR5     : 1;
  __IO uint32_t HTBAR6     : 1;
  __IO uint32_t HTBAR7     : 1;
  __IO uint32_t HTBAR8     : 1;
  __IO uint32_t HTBAR9     : 1;
  __IO uint32_t HTBAR10    : 1;
  __IO uint32_t HTBAR11    : 1;
  __IO uint32_t HTBAR12    : 1;
  __IO uint32_t HTBAR13    : 1;
  __IO uint32_t HTBAR14    : 1;
  __IO uint32_t HTBAR15    : 1;
  __IO uint32_t HTBAR16    : 1;
  __IO uint32_t HTBAR17    : 1;
  __IO uint32_t HTBAR18    : 1;
  __IO uint32_t HTBAR19    : 1;
  __IO uint32_t HTBAR20    : 1;
  __IO uint32_t HTBAR21    : 1;
  __IO uint32_t HTBAR22    : 1;
  __IO uint32_t HTBAR23    : 1;
  __IO uint32_t HTBAR24    : 1;
  __IO uint32_t HTBAR25    : 1;
  __IO uint32_t HTBAR26    : 1;
  __IO uint32_t HTBAR27    : 1;
  __IO uint32_t HTBAR28    : 1;
  __IO uint32_t HTBAR29    : 1;
  __IO uint32_t HTBAR30    : 1;
  __IO uint32_t HTBAR31    : 1;
} stc_ethernet_mac_chtbar_field_t;

