RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_GPIO_PCR5_P4                      *((volatile unsigned int*)(0x42662290UL))
#define bFM3_GPIO_PCR5_P5                      *((volatile unsigned int*)(0x42662294UL))
#define bFM3_GPIO_PCR5_P6                      *((volatile unsigned int*)(0x42662298UL))
#define bFM3_GPIO_PCR5_P7                      *((volatile unsigned int*)(0x4266229CUL))
#define bFM3_GPIO_PCR5_P8                      *((volatile unsigned int*)(0x426622A0UL))
#define bFM3_GPIO_PCR5_P9                      *((volatile unsigned int*)(0x426622A4UL))
#define bFM3_GPIO_PCR5_PA                      *((volatile unsigned int*)(0x426622A8UL))
#define bFM3_GPIO_PCR5_PB                      *((volatile unsigned int*)(0x426622ACUL))
#define bFM3_GPIO_PCR5_PC                      *((volatile unsigned int*)(0x426622B0UL))
#define bFM3_GPIO_PCR5_PD                      *((volatile unsigned int*)(0x426622B4UL))
#define bFM3_GPIO_PCR6_P0                      *((volatile unsigned int*)(0x42662300UL))
#define bFM3_GPIO_PCR6_P1                      *((volatile unsigned int*)(0x42662304UL))
#define bFM3_GPIO_PCR6_P2                      *((volatile unsigned int*)(0x42662308UL))
#define bFM3_GPIO_PCR7_P0                      *((volatile unsigned int*)(0x42662380UL))
#define bFM3_GPIO_PCR7_P1                      *((volatile unsigned int*)(0x42662384UL))
#define bFM3_GPIO_PCR7_P2                      *((volatile unsigned int*)(0x42662388UL))
#define bFM3_GPIO_PCR7_P3                      *((volatile unsigned int*)(0x4266238CUL))
#define bFM3_GPIO_PCR7_P4                      *((volatile unsigned int*)(0x42662390UL))
#define bFM3_GPIO_PCR7_P5                      *((volatile unsigned int*)(0x42662394UL))
#define bFM3_GPIO_PCR7_P6                      *((volatile unsigned int*)(0x42662398UL))
#define bFM3_GPIO_PCR7_P7                      *((volatile unsigned int*)(0x4266239CUL))
#define bFM3_GPIO_PCR7_P8                      *((volatile unsigned int*)(0x426623A0UL))
#define bFM3_GPIO_PCR7_P9                      *((volatile unsigned int*)(0x426623A4UL))
#define bFM3_GPIO_PCR7_PA                      *((volatile unsigned int*)(0x426623A8UL))
#define bFM3_GPIO_PCR7_PB                      *((volatile unsigned int*)(0x426623ACUL))
#define bFM3_GPIO_PCR7_PC                      *((volatile unsigned int*)(0x426623B0UL))
#define bFM3_GPIO_PCR7_PD                      *((volatile unsigned int*)(0x426623B4UL))
#define bFM3_GPIO_PCR7_PE                      *((volatile unsigned int*)(0x426623B8UL))
#define bFM3_GPIO_PCR7_PF                      *((volatile unsigned int*)(0x426623BCUL))
#define bFM3_GPIO_PCR9_P0                      *((volatile unsigned int*)(0x42662480UL))
#define bFM3_GPIO_PCR9_P1                      *((volatile unsigned int*)(0x42662484UL))
#define bFM3_GPIO_PCR9_P2                      *((volatile unsigned int*)(0x42662488UL))
#define bFM3_GPIO_PCR9_P3                      *((volatile unsigned int*)(0x4266248CUL))
#define bFM3_GPIO_PCR9_P4                      *((volatile unsigned int*)(0x42662490UL))
#define bFM3_GPIO_PCR9_P5                      *((volatile unsigned int*)(0x42662494UL))
#define bFM3_GPIO_PCRA_P0                      *((volatile unsigned int*)(0x42662500UL))
#define bFM3_GPIO_PCRA_P1                      *((volatile unsigned int*)(0x42662504UL))
#define bFM3_GPIO_PCRA_P2                      *((volatile unsigned int*)(0x42662508UL))
#define bFM3_GPIO_PCRA_P3                      *((volatile unsigned int*)(0x4266250CUL))
#define bFM3_GPIO_PCRA_P4                      *((volatile unsigned int*)(0x42662510UL))
#define bFM3_GPIO_PCRA_P5                      *((volatile unsigned int*)(0x42662514UL))
#define bFM3_GPIO_PCRB_P0                      *((volatile unsigned int*)(0x42662580UL))
#define bFM3_GPIO_PCRB_P1                      *((volatile unsigned int*)(0x42662584UL))
#define bFM3_GPIO_PCRB_P2                      *((volatile unsigned int*)(0x42662588UL))
#define bFM3_GPIO_PCRB_P3                      *((volatile unsigned int*)(0x4266258CUL))
#define bFM3_GPIO_PCRB_P4                      *((volatile unsigned int*)(0x42662590UL))
#define bFM3_GPIO_PCRB_P5                      *((volatile unsigned int*)(0x42662594UL))
#define bFM3_GPIO_PCRB_P6                      *((volatile unsigned int*)(0x42662598UL))
#define bFM3_GPIO_PCRB_P7                      *((volatile unsigned int*)(0x4266259CUL))
#define bFM3_GPIO_PCRC_P0                      *((volatile unsigned int*)(0x42662600UL))
#define bFM3_GPIO_PCRC_P1                      *((volatile unsigned int*)(0x42662604UL))
#define bFM3_GPIO_PCRC_P2                      *((volatile unsigned int*)(0x42662608UL))
#define bFM3_GPIO_PCRC_P3                      *((volatile unsigned int*)(0x4266260CUL))
#define bFM3_GPIO_PCRC_P4                      *((volatile unsigned int*)(0x42662610UL))
#define bFM3_GPIO_PCRC_P5                      *((volatile unsigned int*)(0x42662614UL))
#define bFM3_GPIO_PCRC_P6                      *((volatile unsigned int*)(0x42662618UL))
#define bFM3_GPIO_PCRC_P7                      *((volatile unsigned int*)(0x4266261CUL))
#define bFM3_GPIO_PCRC_P8                      *((volatile unsigned int*)(0x42662620UL))
#define bFM3_GPIO_PCRC_P9                      *((volatile unsigned int*)(0x42662624UL))
#define bFM3_GPIO_PCRC_PA                      *((volatile unsigned int*)(0x42662628UL))
#define bFM3_GPIO_PCRC_PB                      *((volatile unsigned int*)(0x4266262CUL))
#define bFM3_GPIO_PCRC_PC                      *((volatile unsigned int*)(0x42662630UL))
#define bFM3_GPIO_PCRC_PD                      *((volatile unsigned int*)(0x42662634UL))
#define bFM3_GPIO_PCRC_PE                      *((volatile unsigned int*)(0x42662638UL))
#define bFM3_GPIO_PCRC_PF                      *((volatile unsigned int*)(0x4266263CUL))
#define bFM3_GPIO_PCRD_P0                      *((volatile unsigned int*)(0x42662680UL))
#define bFM3_GPIO_PCRD_P1                      *((volatile unsigned int*)(0x42662684UL))
#define bFM3_GPIO_PCRD_P2                      *((volatile unsigned int*)(0x42662688UL))
#define bFM3_GPIO_PCRD_P3                      *((volatile unsigned int*)(0x4266268CUL))
#define bFM3_GPIO_PCRE_P2                      *((volatile unsigned int*)(0x42662708UL))
#define bFM3_GPIO_PCRE_P3                      *((volatile unsigned int*)(0x4266270CUL))
#define bFM3_GPIO_DDR0_P0                      *((volatile unsigned int*)(0x42664000UL))
#define bFM3_GPIO_DDR0_P1                      *((volatile unsigned int*)(0x42664004UL))
#define bFM3_GPIO_DDR0_P2                      *((volatile unsigned int*)(0x42664008UL))
#define bFM3_GPIO_DDR0_P3                      *((volatile unsigned int*)(0x4266400CUL))
#define bFM3_GPIO_DDR0_P4                      *((volatile unsigned int*)(0x42664010UL))
#define bFM3_GPIO_DDR0_P5                      *((volatile unsigned int*)(0x42664014UL))
#define bFM3_GPIO_DDR0_P6                      *((volatile unsigned int*)(0x42664018UL))
#define bFM3_GPIO_DDR0_P7                      *((volatile unsigned int*)(0x4266401CUL))
#define bFM3_GPIO_DDR0_P8                      *((volatile unsigned int*)(0x42664020UL))
#define bFM3_GPIO_DDR0_P9                      *((volatile unsigned int*)(0x42664024UL))
#define bFM3_GPIO_DDR1_P0                      *((volatile unsigned int*)(0x42664080UL))
#define bFM3_GPIO_DDR1_P1                      *((volatile unsigned int*)(0x42664084UL))
#define bFM3_GPIO_DDR1_P2                      *((volatile unsigned int*)(0x42664088UL))
#define bFM3_GPIO_DDR1_P3                      *((volatile unsigned int*)(0x4266408CUL))
#define bFM3_GPIO_DDR1_P4                      *((volatile unsigned int*)(0x42664090UL))
#define bFM3_GPIO_DDR1_P5                      *((volatile unsigned int*)(0x42664094UL))
#define bFM3_GPIO_DDR1_P6                      *((volatile unsigned int*)(0x42664098UL))
#define bFM3_GPIO_DDR1_P7                      *((volatile unsigned int*)(0x4266409CUL))
#define bFM3_GPIO_DDR1_P8                      *((volatile unsigned int*)(0x426640A0UL))
#define bFM3_GPIO_DDR1_P9                      *((volatile unsigned int*)(0x426640A4UL))
#define bFM3_GPIO_DDR1_PA                      *((volatile unsigned int*)(0x426640A8UL))
#define bFM3_GPIO_DDR1_PB                      *((volatile unsigned int*)(0x426640ACUL))
#define bFM3_GPIO_DDR1_PC                      *((volatile unsigned int*)(0x426640B0UL))
#define bFM3_GPIO_DDR1_PD                      *((volatile unsigned int*)(0x426640B4UL))
#define bFM3_GPIO_DDR1_PE                      *((volatile unsigned int*)(0x426640B8UL))
#define bFM3_GPIO_DDR1_PF                      *((volatile unsigned int*)(0x426640BCUL))
#define bFM3_GPIO_DDR2_P0                      *((volatile unsigned int*)(0x42664100UL))
#define bFM3_GPIO_DDR2_P1                      *((volatile unsigned int*)(0x42664104UL))
#define bFM3_GPIO_DDR2_P2                      *((volatile unsigned int*)(0x42664108UL))
#define bFM3_GPIO_DDR2_P3                      *((volatile unsigned int*)(0x4266410CUL))
#define bFM3_GPIO_DDR2_P4                      *((volatile unsigned int*)(0x42664110UL))
#define bFM3_GPIO_DDR2_P5                      *((volatile unsigned int*)(0x42664114UL))
#define bFM3_GPIO_DDR2_P6                      *((volatile unsigned int*)(0x42664118UL))
#define bFM3_GPIO_DDR2_P7                      *((volatile unsigned int*)(0x4266411CUL))
#define bFM3_GPIO_DDR2_P8                      *((volatile unsigned int*)(0x42664120UL))
#define bFM3_GPIO_DDR2_P9                      *((volatile unsigned int*)(0x42664124UL))
#define bFM3_GPIO_DDR3_P0                      *((volatile unsigned int*)(0x42664180UL))
#define bFM3_GPIO_DDR3_P1                      *((volatile unsigned int*)(0x42664184UL))
#define bFM3_GPIO_DDR3_P2                      *((volatile unsigned int*)(0x42664188UL))
#define bFM3_GPIO_DDR3_P3                      *((volatile unsigned int*)(0x4266418CUL))
#define bFM3_GPIO_DDR3_P4                      *((volatile unsigned int*)(0x42664190UL))
#define bFM3_GPIO_DDR3_P5                      *((volatile unsigned int*)(0x42664194UL))
#define bFM3_GPIO_DDR3_P6                      *((volatile unsigned int*)(0x42664198UL))
#define bFM3_GPIO_DDR3_P7                      *((volatile unsigned int*)(0x4266419CUL))
#define bFM3_GPIO_DDR3_P8                      *((volatile unsigned int*)(0x426641A0UL))
#define bFM3_GPIO_DDR3_P9                      *((volatile unsigned int*)(0x426641A4UL))
#define bFM3_GPIO_DDR3_PA                      *((volatile unsigned int*)(0x426641A8UL))
#define bFM3_GPIO_DDR3_PB                      *((volatile unsigned int*)(0x426641ACUL))
#define bFM3_GPIO_DDR3_PC                      *((volatile unsigned int*)(0x426641B0UL))
#define bFM3_GPIO_DDR3_PD                      *((volatile unsigned int*)(0x426641B4UL))
#define bFM3_GPIO_DDR3_PE                      *((volatile unsigned int*)(0x426641B8UL))
#define bFM3_GPIO_DDR3_PF                      *((volatile unsigned int*)(0x426641BCUL))
#define bFM3_GPIO_DDR4_P0                      *((volatile unsigned int*)(0x42664200UL))
#define bFM3_GPIO_DDR4_P1                      *((volatile unsigned int*)(0x42664204UL))
#define bFM3_GPIO_DDR4_P2                      *((volatile unsigned int*)(0x42664208UL))
#define bFM3_GPIO_DDR4_P3                      *((volatile unsigned int*)(0x4266420CUL))
#define bFM3_GPIO_DDR4_P4                      *((volatile unsigned int*)(0x42664210UL))
#define bFM3_GPIO_DDR4_P5                      *((volatile unsigned int*)(0x42664214UL))
#define bFM3_GPIO_DDR4_P6                      *((volatile unsigned int*)(0x42664218UL))
#define bFM3_GPIO_DDR4_P7                      *((volatile unsigned int*)(0x4266421CUL))
#define bFM3_GPIO_DDR4_P8                      *((volatile unsigned int*)(0x42664220UL))
#define bFM3_GPIO_DDR4_P9                      *((volatile unsigned int*)(0x42664224UL))
#define bFM3_GPIO_DDR4_PA                      *((volatile unsigned int*)(0x42664228UL))
#define bFM3_GPIO_DDR4_PB                      *((volatile unsigned int*)(0x4266422CUL))
#define bFM3_GPIO_DDR4_PC                      *((volatile unsigned int*)(0x42664230UL))
#define bFM3_GPIO_DDR4_PD                      *((volatile unsigned int*)(0x42664234UL))
#define bFM3_GPIO_DDR4_PE                      *((volatile unsigned int*)(0x42664238UL))
#define bFM3_GPIO_DDR5_P0                      *((volatile unsigned int*)(0x42664280UL))
#define bFM3_GPIO_DDR5_P1                      *((volatile unsigned int*)(0x42664284UL))
#define bFM3_GPIO_DDR5_P2                      *((volatile unsigned int*)(0x42664288UL))
#define bFM3_GPIO_DDR5_P3                      *((volatile unsigned int*)(0x4266428CUL))
#define bFM3_GPIO_DDR5_P4                      *((volatile unsigned int*)(0x42664290UL))
#define bFM3_GPIO_DDR5_P5                      *((volatile unsigned int*)(0x42664294UL))
#define bFM3_GPIO_DDR5_P6                      *((volatile unsigned int*)(0x42664298UL))
#define bFM3_GPIO_DDR5_P7                      *((volatile unsigned int*)(0x4266429CUL))
#define bFM3_GPIO_DDR5_P8                      *((volatile unsigned int*)(0x426642A0UL))
#define bFM3_GPIO_DDR5_P9                      *((volatile unsigned int*)(0x426642A4UL))
#define bFM3_GPIO_DDR5_PA                      *((volatile unsigned int*)(0x426642A8UL))
#define bFM3_GPIO_DDR5_PB                      *((volatile unsigned int*)(0x426642ACUL))
#define bFM3_GPIO_DDR5_PC                      *((volatile unsigned int*)(0x426642B0UL))
#define bFM3_GPIO_DDR5_PD                      *((volatile unsigned int*)(0x426642B4UL))
#define bFM3_GPIO_DDR6_P0                      *((volatile unsigned int*)(0x42664300UL))
#define bFM3_GPIO_DDR6_P1                      *((volatile unsigned int*)(0x42664304UL))
#define bFM3_GPIO_DDR6_P2                      *((volatile unsigned int*)(0x42664308UL))
#define bFM3_GPIO_DDR7_P0                      *((volatile unsigned int*)(0x42664380UL))
#define bFM3_GPIO_DDR7_P1                      *((volatile unsigned int*)(0x42664384UL))
#define bFM3_GPIO_DDR7_P2                      *((volatile unsigned int*)(0x42664388UL))
#define bFM3_GPIO_DDR7_P3                      *((volatile unsigned int*)(0x4266438CUL))
#define bFM3_GPIO_DDR7_P4                      *((volatile unsigned int*)(0x42664390UL))
#define bFM3_GPIO_DDR7_P5                      *((volatile unsigned int*)(0x42664394UL))
#define bFM3_GPIO_DDR7_P6                      *((volatile unsigned int*)(0x42664398UL))
#define bFM3_GPIO_DDR7_P7                      *((volatile unsigned int*)(0x4266439CUL))
#define bFM3_GPIO_DDR7_P8                      *((volatile unsigned int*)(0x426643A0UL))
#define bFM3_GPIO_DDR7_P9                      *((volatile unsigned int*)(0x426643A4UL))
#define bFM3_GPIO_DDR7_PA                      *((volatile unsigned int*)(0x426643A8UL))
#define bFM3_GPIO_DDR7_PB                      *((volatile unsigned int*)(0x426643ACUL))
#define bFM3_GPIO_DDR7_PC                      *((volatile unsigned int*)(0x426643B0UL))
#define bFM3_GPIO_DDR7_PD                      *((volatile unsigned int*)(0x426643B4UL))
#define bFM3_GPIO_DDR7_PE                      *((volatile unsigned int*)(0x426643B8UL))
#define bFM3_GPIO_DDR7_PF                      *((volatile unsigned int*)(0x426643BCUL))
#define bFM3_GPIO_DDR8_P0                      *((volatile unsigned int*)(0x42664400UL))
#define bFM3_GPIO_DDR8_P1                      *((volatile unsigned int*)(0x42664404UL))
#define bFM3_GPIO_DDR8_P2                      *((volatile unsigned int*)(0x42664408UL))
#define bFM3_GPIO_DDR8_P3                      *((volatile unsigned int*)(0x4266440CUL))
#define bFM3_GPIO_DDR9_P0                      *((volatile unsigned int*)(0x42664480UL))
#define bFM3_GPIO_DDR9_P1                      *((volatile unsigned int*)(0x42664484UL))
#define bFM3_GPIO_DDR9_P2                      *((volatile unsigned int*)(0x42664488UL))
#define bFM3_GPIO_DDR9_P3                      *((volatile unsigned int*)(0x4266448CUL))
#define bFM3_GPIO_DDR9_P4                      *((volatile unsigned int*)(0x42664490UL))
#define bFM3_GPIO_DDR9_P5                      *((volatile unsigned int*)(0x42664494UL))
#define bFM3_GPIO_DDRA_P0                      *((volatile unsigned int*)(0x42664500UL))
#define bFM3_GPIO_DDRA_P1                      *((volatile unsigned int*)(0x42664504UL))
#define bFM3_GPIO_DDRA_P2                      *((volatile unsigned int*)(0x42664508UL))
#define bFM3_GPIO_DDRA_P3                      *((volatile unsigned int*)(0x4266450CUL))
#define bFM3_GPIO_DDRA_P4                      *((volatile unsigned int*)(0x42664510UL))
#define bFM3_GPIO_DDRA_P5                      *((volatile unsigned int*)(0x42664514UL))
#define bFM3_GPIO_DDRB_P0                      *((volatile unsigned int*)(0x42664580UL))
#define bFM3_GPIO_DDRB_P1                      *((volatile unsigned int*)(0x42664584UL))
#define bFM3_GPIO_DDRB_P2                      *((volatile unsigned int*)(0x42664588UL))
#define bFM3_GPIO_DDRB_P3                      *((volatile unsigned int*)(0x4266458CUL))
#define bFM3_GPIO_DDRB_P4                      *((volatile unsigned int*)(0x42664590UL))
#define bFM3_GPIO_DDRB_P5                      *((volatile unsigned int*)(0x42664594UL))
#define bFM3_GPIO_DDRB_P6                      *((volatile unsigned int*)(0x42664598UL))
#define bFM3_GPIO_DDRB_P7                      *((volatile unsigned int*)(0x4266459CUL))
#define bFM3_GPIO_DDRC_P0                      *((volatile unsigned int*)(0x42664600UL))
#define bFM3_GPIO_DDRC_P1                      *((volatile unsigned int*)(0x42664604UL))
#define bFM3_GPIO_DDRC_P2                      *((volatile unsigned int*)(0x42664608UL))
#define bFM3_GPIO_DDRC_P3                      *((volatile unsigned int*)(0x4266460CUL))
#define bFM3_GPIO_DDRC_P4                      *((volatile unsigned int*)(0x42664610UL))
#define bFM3_GPIO_DDRC_P5                      *((volatile unsigned int*)(0x42664614UL))
#define bFM3_GPIO_DDRC_P6                      *((volatile unsigned int*)(0x42664618UL))
#define bFM3_GPIO_DDRC_P7                      *((volatile unsigned int*)(0x4266461CUL))
#define bFM3_GPIO_DDRC_P8                      *((volatile unsigned int*)(0x42664620UL))
#define bFM3_GPIO_DDRC_P9                      *((volatile unsigned int*)(0x42664624UL))
#define bFM3_GPIO_DDRC_PA                      *((volatile unsigned int*)(0x42664628UL))
#define bFM3_GPIO_DDRC_PB                      *((volatile unsigned int*)(0x4266462CUL))
#define bFM3_GPIO_DDRC_PC                      *((volatile unsigned int*)(0x42664630UL))
#define bFM3_GPIO_DDRC_PD                      *((volatile unsigned int*)(0x42664634UL))
#define bFM3_GPIO_DDRC_PE                      *((volatile unsigned int*)(0x42664638UL))
#define bFM3_GPIO_DDRC_PF                      *((volatile unsigned int*)(0x4266463CUL))
#define bFM3_GPIO_DDRD_P0                      *((volatile unsigned int*)(0x42664680UL))
#define bFM3_GPIO_DDRD_P1                      *((volatile unsigned int*)(0x42664684UL))
#define bFM3_GPIO_DDRD_P2                      *((volatile unsigned int*)(0x42664688UL))
#define bFM3_GPIO_DDRD_P3                      *((volatile unsigned int*)(0x4266468CUL))
#define bFM3_GPIO_DDRE_P0                      *((volatile unsigned int*)(0x42664700UL))
#define bFM3_GPIO_DDRE_P2                      *((volatile unsigned int*)(0x42664708UL))
#define bFM3_GPIO_DDRE_P3                      *((volatile unsigned int*)(0x4266470CUL))
#define bFM3_GPIO_DDRF_P0                      *((volatile unsigned int*)(0x42664780UL))
#define bFM3_GPIO_DDRF_P1                      *((volatile unsigned int*)(0x42664784UL))
#define bFM3_GPIO_DDRF_P2                      *((volatile unsigned int*)(0x42664788UL))
#define bFM3_GPIO_DDRF_P3                      *((volatile unsigned int*)(0x4266478CUL))
#define bFM3_GPIO_DDRF_P4                      *((volatile unsigned int*)(0x42664790UL))
#define bFM3_GPIO_DDRF_P5                      *((volatile unsigned int*)(0x42664794UL))
#define bFM3_GPIO_DDRF_P6                      *((volatile unsigned int*)(0x42664798UL))
#define bFM3_GPIO_PDIR0_P0                     *((volatile unsigned int*)(0x42666000UL))
#define bFM3_GPIO_PDIR0_P1                     *((volatile unsigned int*)(0x42666004UL))
#define bFM3_GPIO_PDIR0_P2                     *((volatile unsigned int*)(0x42666008UL))
#define bFM3_GPIO_PDIR0_P3                     *((volatile unsigned int*)(0x4266600CUL))
#define bFM3_GPIO_PDIR0_P4                     *((volatile unsigned int*)(0x42666010UL))
#define bFM3_GPIO_PDIR0_P5                     *((volatile unsigned int*)(0x42666014UL))
#define bFM3_GPIO_PDIR0_P6                     *((volatile unsigned int*)(0x42666018UL))
#define bFM3_GPIO_PDIR0_P7                     *((volatile unsigned int*)(0x4266601CUL))
#define bFM3_GPIO_PDIR0_P8                     *((volatile unsigned int*)(0x42666020UL))
#define bFM3_GPIO_PDIR0_P9                     *((volatile unsigned int*)(0x42666024UL))
#define bFM3_GPIO_PDIR1_P0                     *((volatile unsigned int*)(0x42666080UL))
#define bFM3_GPIO_PDIR1_P1                     *((volatile unsigned int*)(0x42666084UL))
#define bFM3_GPIO_PDIR1_P2                     *((volatile unsigned int*)(0x42666088UL))
#define bFM3_GPIO_PDIR1_P3                     *((volatile unsigned int*)(0x4266608CUL))
#define bFM3_GPIO_PDIR1_P4                     *((volatile unsigned int*)(0x42666090UL))
#define bFM3_GPIO_PDIR1_P5                     *((volatile unsigned int*)(0x42666094UL))
#define bFM3_GPIO_PDIR1_P6                     *((volatile unsigned int*)(0x42666098UL))
#define bFM3_GPIO_PDIR1_P7                     *((volatile unsigned int*)(0x4266609CUL))
#define bFM3_GPIO_PDIR1_P8                     *((volatile unsigned int*)(0x426660A0UL))
#define bFM3_GPIO_PDIR1_P9                     *((volatile unsigned int*)(0x426660A4UL))
#define bFM3_GPIO_PDIR1_PA                     *((volatile unsigned int*)(0x426660A8UL))
#define bFM3_GPIO_PDIR1_PB                     *((volatile unsigned int*)(0x426660ACUL))
#define bFM3_GPIO_PDIR1_PC                     *((volatile unsigned int*)(0x426660B0UL))
#define bFM3_GPIO_PDIR1_PD                     *((volatile unsigned int*)(0x426660B4UL))
#define bFM3_GPIO_PDIR1_PE                     *((volatile unsigned int*)(0x426660B8UL))
#define bFM3_GPIO_PDIR1_PF                     *((volatile unsigned int*)(0x426660BCUL))
#define bFM3_GPIO_PDIR2_P0                     *((volatile unsigned int*)(0x42666100UL))
#define bFM3_GPIO_PDIR2_P1                     *((volatile unsigned int*)(0x42666104UL))
#define bFM3_GPIO_PDIR2_P2                     *((volatile unsigned int*)(0x42666108UL))
#define bFM3_GPIO_PDIR2_P3                     *((volatile unsigned int*)(0x4266610CUL))
#define bFM3_GPIO_PDIR2_P4                     *((volatile unsigned int*)(0x42666110UL))
#define bFM3_GPIO_PDIR2_P5                     *((volatile unsigned int*)(0x42666114UL))
#define bFM3_GPIO_PDIR2_P6                     *((volatile unsigned int*)(0x42666118UL))
#define bFM3_GPIO_PDIR2_P7                     *((volatile unsigned int*)(0x4266611CUL))
#define bFM3_GPIO_PDIR2_P8                     *((volatile unsigned int*)(0x42666120UL))
#define bFM3_GPIO_PDIR2_P9                     *((volatile unsigned int*)(0x42666124UL))
#define bFM3_GPIO_PDIR3_P0                     *((volatile unsigned int*)(0x42666180UL))
#define bFM3_GPIO_PDIR3_P1                     *((volatile unsigned int*)(0x42666184UL))
#define bFM3_GPIO_PDIR3_P2                     *((volatile unsigned int*)(0x42666188UL))
#define bFM3_GPIO_PDIR3_P3                     *((volatile unsigned int*)(0x4266618CUL))
#define bFM3_GPIO_PDIR3_P4                     *((volatile unsigned int*)(0x42666190UL))
#define bFM3_GPIO_PDIR3_P5                     *((volatile unsigned int*)(0x42666194UL))
#define bFM3_GPIO_PDIR3_P6                     *((volatile unsigned int*)(0x42666198UL))
#define bFM3_GPIO_PDIR3_P7                     *((volatile unsigned int*)(0x4266619CUL))
