RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_GPIO_PDIR3_P8                     *((volatile unsigned int*)(0x426661A0UL))
#define bFM3_GPIO_PDIR3_P9                     *((volatile unsigned int*)(0x426661A4UL))
#define bFM3_GPIO_PDIR3_PA                     *((volatile unsigned int*)(0x426661A8UL))
#define bFM3_GPIO_PDIR3_PB                     *((volatile unsigned int*)(0x426661ACUL))
#define bFM3_GPIO_PDIR3_PC                     *((volatile unsigned int*)(0x426661B0UL))
#define bFM3_GPIO_PDIR3_PD                     *((volatile unsigned int*)(0x426661B4UL))
#define bFM3_GPIO_PDIR3_PE                     *((volatile unsigned int*)(0x426661B8UL))
#define bFM3_GPIO_PDIR3_PF                     *((volatile unsigned int*)(0x426661BCUL))
#define bFM3_GPIO_PDIR4_P0                     *((volatile unsigned int*)(0x42666200UL))
#define bFM3_GPIO_PDIR4_P1                     *((volatile unsigned int*)(0x42666204UL))
#define bFM3_GPIO_PDIR4_P2                     *((volatile unsigned int*)(0x42666208UL))
#define bFM3_GPIO_PDIR4_P3                     *((volatile unsigned int*)(0x4266620CUL))
#define bFM3_GPIO_PDIR4_P4                     *((volatile unsigned int*)(0x42666210UL))
#define bFM3_GPIO_PDIR4_P5                     *((volatile unsigned int*)(0x42666214UL))
#define bFM3_GPIO_PDIR4_P6                     *((volatile unsigned int*)(0x42666218UL))
#define bFM3_GPIO_PDIR4_P7                     *((volatile unsigned int*)(0x4266621CUL))
#define bFM3_GPIO_PDIR4_P8                     *((volatile unsigned int*)(0x42666220UL))
#define bFM3_GPIO_PDIR4_P9                     *((volatile unsigned int*)(0x42666224UL))
#define bFM3_GPIO_PDIR4_PA                     *((volatile unsigned int*)(0x42666228UL))
#define bFM3_GPIO_PDIR4_PB                     *((volatile unsigned int*)(0x4266622CUL))
#define bFM3_GPIO_PDIR4_PC                     *((volatile unsigned int*)(0x42666230UL))
#define bFM3_GPIO_PDIR4_PD                     *((volatile unsigned int*)(0x42666234UL))
#define bFM3_GPIO_PDIR4_PE                     *((volatile unsigned int*)(0x42666238UL))
#define bFM3_GPIO_PDIR5_P0                     *((volatile unsigned int*)(0x42666280UL))
#define bFM3_GPIO_PDIR5_P1                     *((volatile unsigned int*)(0x42666284UL))
#define bFM3_GPIO_PDIR5_P2                     *((volatile unsigned int*)(0x42666288UL))
#define bFM3_GPIO_PDIR5_P3                     *((volatile unsigned int*)(0x4266628CUL))
#define bFM3_GPIO_PDIR5_P4                     *((volatile unsigned int*)(0x42666290UL))
#define bFM3_GPIO_PDIR5_P5                     *((volatile unsigned int*)(0x42666294UL))
#define bFM3_GPIO_PDIR5_P6                     *((volatile unsigned int*)(0x42666298UL))
#define bFM3_GPIO_PDIR5_P7                     *((volatile unsigned int*)(0x4266629CUL))
#define bFM3_GPIO_PDIR5_P8                     *((volatile unsigned int*)(0x426662A0UL))
#define bFM3_GPIO_PDIR5_P9                     *((volatile unsigned int*)(0x426662A4UL))
#define bFM3_GPIO_PDIR5_PA                     *((volatile unsigned int*)(0x426662A8UL))
#define bFM3_GPIO_PDIR5_PB                     *((volatile unsigned int*)(0x426662ACUL))
#define bFM3_GPIO_PDIR5_PC                     *((volatile unsigned int*)(0x426662B0UL))
#define bFM3_GPIO_PDIR5_PD                     *((volatile unsigned int*)(0x426662B4UL))
#define bFM3_GPIO_PDIR6_P0                     *((volatile unsigned int*)(0x42666300UL))
#define bFM3_GPIO_PDIR6_P1                     *((volatile unsigned int*)(0x42666304UL))
#define bFM3_GPIO_PDIR6_P2                     *((volatile unsigned int*)(0x42666308UL))
#define bFM3_GPIO_PDIR7_P0                     *((volatile unsigned int*)(0x42666380UL))
#define bFM3_GPIO_PDIR7_P1                     *((volatile unsigned int*)(0x42666384UL))
#define bFM3_GPIO_PDIR7_P2                     *((volatile unsigned int*)(0x42666388UL))
#define bFM3_GPIO_PDIR7_P3                     *((volatile unsigned int*)(0x4266638CUL))
#define bFM3_GPIO_PDIR7_P4                     *((volatile unsigned int*)(0x42666390UL))
#define bFM3_GPIO_PDIR7_P5                     *((volatile unsigned int*)(0x42666394UL))
#define bFM3_GPIO_PDIR7_P6                     *((volatile unsigned int*)(0x42666398UL))
#define bFM3_GPIO_PDIR7_P7                     *((volatile unsigned int*)(0x4266639CUL))
#define bFM3_GPIO_PDIR7_P8                     *((volatile unsigned int*)(0x426663A0UL))
#define bFM3_GPIO_PDIR7_P9                     *((volatile unsigned int*)(0x426663A4UL))
#define bFM3_GPIO_PDIR7_PA                     *((volatile unsigned int*)(0x426663A8UL))
#define bFM3_GPIO_PDIR7_PB                     *((volatile unsigned int*)(0x426663ACUL))
#define bFM3_GPIO_PDIR7_PC                     *((volatile unsigned int*)(0x426663B0UL))
#define bFM3_GPIO_PDIR7_PD                     *((volatile unsigned int*)(0x426663B4UL))
#define bFM3_GPIO_PDIR7_PE                     *((volatile unsigned int*)(0x426663B8UL))
#define bFM3_GPIO_PDIR7_PF                     *((volatile unsigned int*)(0x426663BCUL))
#define bFM3_GPIO_PDIR8_P0                     *((volatile unsigned int*)(0x42666400UL))
#define bFM3_GPIO_PDIR8_P1                     *((volatile unsigned int*)(0x42666404UL))
#define bFM3_GPIO_PDIR8_P2                     *((volatile unsigned int*)(0x42666408UL))
#define bFM3_GPIO_PDIR8_P3                     *((volatile unsigned int*)(0x4266640CUL))
#define bFM3_GPIO_PDIR9_P0                     *((volatile unsigned int*)(0x42666480UL))
#define bFM3_GPIO_PDIR9_P1                     *((volatile unsigned int*)(0x42666484UL))
#define bFM3_GPIO_PDIR9_P2                     *((volatile unsigned int*)(0x42666488UL))
#define bFM3_GPIO_PDIR9_P3                     *((volatile unsigned int*)(0x4266648CUL))
#define bFM3_GPIO_PDIR9_P4                     *((volatile unsigned int*)(0x42666490UL))
#define bFM3_GPIO_PDIR9_P5                     *((volatile unsigned int*)(0x42666494UL))
#define bFM3_GPIO_PDIRA_P0                     *((volatile unsigned int*)(0x42666500UL))
#define bFM3_GPIO_PDIRA_P1                     *((volatile unsigned int*)(0x42666504UL))
#define bFM3_GPIO_PDIRA_P2                     *((volatile unsigned int*)(0x42666508UL))
#define bFM3_GPIO_PDIRA_P3                     *((volatile unsigned int*)(0x4266650CUL))
#define bFM3_GPIO_PDIRA_P4                     *((volatile unsigned int*)(0x42666510UL))
#define bFM3_GPIO_PDIRA_P5                     *((volatile unsigned int*)(0x42666514UL))
#define bFM3_GPIO_PDIRB_P0                     *((volatile unsigned int*)(0x42666580UL))
#define bFM3_GPIO_PDIRB_P1                     *((volatile unsigned int*)(0x42666584UL))
#define bFM3_GPIO_PDIRB_P2                     *((volatile unsigned int*)(0x42666588UL))
#define bFM3_GPIO_PDIRB_P3                     *((volatile unsigned int*)(0x4266658CUL))
#define bFM3_GPIO_PDIRB_P4                     *((volatile unsigned int*)(0x42666590UL))
#define bFM3_GPIO_PDIRB_P5                     *((volatile unsigned int*)(0x42666594UL))
#define bFM3_GPIO_PDIRB_P6                     *((volatile unsigned int*)(0x42666598UL))
#define bFM3_GPIO_PDIRB_P7                     *((volatile unsigned int*)(0x4266659CUL))
#define bFM3_GPIO_PDIRC_P0                     *((volatile unsigned int*)(0x42666600UL))
#define bFM3_GPIO_PDIRC_P1                     *((volatile unsigned int*)(0x42666604UL))
#define bFM3_GPIO_PDIRC_P2                     *((volatile unsigned int*)(0x42666608UL))
#define bFM3_GPIO_PDIRC_P3                     *((volatile unsigned int*)(0x4266660CUL))
#define bFM3_GPIO_PDIRC_P4                     *((volatile unsigned int*)(0x42666610UL))
#define bFM3_GPIO_PDIRC_P5                     *((volatile unsigned int*)(0x42666614UL))
#define bFM3_GPIO_PDIRC_P6                     *((volatile unsigned int*)(0x42666618UL))
#define bFM3_GPIO_PDIRC_P7                     *((volatile unsigned int*)(0x4266661CUL))
#define bFM3_GPIO_PDIRC_P8                     *((volatile unsigned int*)(0x42666620UL))
#define bFM3_GPIO_PDIRC_P9                     *((volatile unsigned int*)(0x42666624UL))
#define bFM3_GPIO_PDIRC_PA                     *((volatile unsigned int*)(0x42666628UL))
#define bFM3_GPIO_PDIRC_PB                     *((volatile unsigned int*)(0x4266662CUL))
#define bFM3_GPIO_PDIRC_PC                     *((volatile unsigned int*)(0x42666630UL))
#define bFM3_GPIO_PDIRC_PD                     *((volatile unsigned int*)(0x42666634UL))
#define bFM3_GPIO_PDIRC_PE                     *((volatile unsigned int*)(0x42666638UL))
#define bFM3_GPIO_PDIRC_PF                     *((volatile unsigned int*)(0x4266663CUL))
#define bFM3_GPIO_PDIRD_P0                     *((volatile unsigned int*)(0x42666680UL))
#define bFM3_GPIO_PDIRD_P1                     *((volatile unsigned int*)(0x42666684UL))
#define bFM3_GPIO_PDIRD_P2                     *((volatile unsigned int*)(0x42666688UL))
#define bFM3_GPIO_PDIRD_P3                     *((volatile unsigned int*)(0x4266668CUL))
#define bFM3_GPIO_PDIRE_P0                     *((volatile unsigned int*)(0x42666700UL))
#define bFM3_GPIO_PDIRE_P2                     *((volatile unsigned int*)(0x42666708UL))
#define bFM3_GPIO_PDIRE_P3                     *((volatile unsigned int*)(0x4266670CUL))
#define bFM3_GPIO_PDIRF_P0                     *((volatile unsigned int*)(0x42666780UL))
#define bFM3_GPIO_PDIRF_P1                     *((volatile unsigned int*)(0x42666784UL))
#define bFM3_GPIO_PDIRF_P2                     *((volatile unsigned int*)(0x42666788UL))
#define bFM3_GPIO_PDIRF_P3                     *((volatile unsigned int*)(0x4266678CUL))
#define bFM3_GPIO_PDIRF_P4                     *((volatile unsigned int*)(0x42666790UL))
#define bFM3_GPIO_PDIRF_P5                     *((volatile unsigned int*)(0x42666794UL))
#define bFM3_GPIO_PDIRF_P6                     *((volatile unsigned int*)(0x42666798UL))
#define bFM3_GPIO_PDOR0_P0                     *((volatile unsigned int*)(0x42668000UL))
#define bFM3_GPIO_PDOR0_P1                     *((volatile unsigned int*)(0x42668004UL))
#define bFM3_GPIO_PDOR0_P2                     *((volatile unsigned int*)(0x42668008UL))
#define bFM3_GPIO_PDOR0_P3                     *((volatile unsigned int*)(0x4266800CUL))
#define bFM3_GPIO_PDOR0_P4                     *((volatile unsigned int*)(0x42668010UL))
#define bFM3_GPIO_PDOR0_P5                     *((volatile unsigned int*)(0x42668014UL))
#define bFM3_GPIO_PDOR0_P6                     *((volatile unsigned int*)(0x42668018UL))
#define bFM3_GPIO_PDOR0_P7                     *((volatile unsigned int*)(0x4266801CUL))
#define bFM3_GPIO_PDOR0_P8                     *((volatile unsigned int*)(0x42668020UL))
#define bFM3_GPIO_PDOR0_P9                     *((volatile unsigned int*)(0x42668024UL))
#define bFM3_GPIO_PDOR1_P0                     *((volatile unsigned int*)(0x42668080UL))
#define bFM3_GPIO_PDOR1_P1                     *((volatile unsigned int*)(0x42668084UL))
#define bFM3_GPIO_PDOR1_P2                     *((volatile unsigned int*)(0x42668088UL))
#define bFM3_GPIO_PDOR1_P3                     *((volatile unsigned int*)(0x4266808CUL))
#define bFM3_GPIO_PDOR1_P4                     *((volatile unsigned int*)(0x42668090UL))
#define bFM3_GPIO_PDOR1_P5                     *((volatile unsigned int*)(0x42668094UL))
#define bFM3_GPIO_PDOR1_P6                     *((volatile unsigned int*)(0x42668098UL))
#define bFM3_GPIO_PDOR1_P7                     *((volatile unsigned int*)(0x4266809CUL))
#define bFM3_GPIO_PDOR1_P8                     *((volatile unsigned int*)(0x426680A0UL))
#define bFM3_GPIO_PDOR1_P9                     *((volatile unsigned int*)(0x426680A4UL))
#define bFM3_GPIO_PDOR1_PA                     *((volatile unsigned int*)(0x426680A8UL))
#define bFM3_GPIO_PDOR1_PB                     *((volatile unsigned int*)(0x426680ACUL))
#define bFM3_GPIO_PDOR1_PC                     *((volatile unsigned int*)(0x426680B0UL))
#define bFM3_GPIO_PDOR1_PD                     *((volatile unsigned int*)(0x426680B4UL))
#define bFM3_GPIO_PDOR1_PE                     *((volatile unsigned int*)(0x426680B8UL))
#define bFM3_GPIO_PDOR1_PF                     *((volatile unsigned int*)(0x426680BCUL))
#define bFM3_GPIO_PDOR2_P0                     *((volatile unsigned int*)(0x42668100UL))
#define bFM3_GPIO_PDOR2_P1                     *((volatile unsigned int*)(0x42668104UL))
#define bFM3_GPIO_PDOR2_P2                     *((volatile unsigned int*)(0x42668108UL))
#define bFM3_GPIO_PDOR2_P3                     *((volatile unsigned int*)(0x4266810CUL))
#define bFM3_GPIO_PDOR2_P4                     *((volatile unsigned int*)(0x42668110UL))
#define bFM3_GPIO_PDOR2_P5                     *((volatile unsigned int*)(0x42668114UL))
#define bFM3_GPIO_PDOR2_P6                     *((volatile unsigned int*)(0x42668118UL))
#define bFM3_GPIO_PDOR2_P7                     *((volatile unsigned int*)(0x4266811CUL))
#define bFM3_GPIO_PDOR2_P8                     *((volatile unsigned int*)(0x42668120UL))
#define bFM3_GPIO_PDOR2_P9                     *((volatile unsigned int*)(0x42668124UL))
#define bFM3_GPIO_PDOR3_P0                     *((volatile unsigned int*)(0x42668180UL))
#define bFM3_GPIO_PDOR3_P1                     *((volatile unsigned int*)(0x42668184UL))
#define bFM3_GPIO_PDOR3_P2                     *((volatile unsigned int*)(0x42668188UL))
#define bFM3_GPIO_PDOR3_P3                     *((volatile unsigned int*)(0x4266818CUL))
#define bFM3_GPIO_PDOR3_P4                     *((volatile unsigned int*)(0x42668190UL))
#define bFM3_GPIO_PDOR3_P5                     *((volatile unsigned int*)(0x42668194UL))
#define bFM3_GPIO_PDOR3_P6                     *((volatile unsigned int*)(0x42668198UL))
#define bFM3_GPIO_PDOR3_P7                     *((volatile unsigned int*)(0x4266819CUL))
#define bFM3_GPIO_PDOR3_P8                     *((volatile unsigned int*)(0x426681A0UL))
#define bFM3_GPIO_PDOR3_P9                     *((volatile unsigned int*)(0x426681A4UL))
#define bFM3_GPIO_PDOR3_PA                     *((volatile unsigned int*)(0x426681A8UL))
#define bFM3_GPIO_PDOR3_PB                     *((volatile unsigned int*)(0x426681ACUL))
#define bFM3_GPIO_PDOR3_PC                     *((volatile unsigned int*)(0x426681B0UL))
#define bFM3_GPIO_PDOR3_PD                     *((volatile unsigned int*)(0x426681B4UL))
#define bFM3_GPIO_PDOR3_PE                     *((volatile unsigned int*)(0x426681B8UL))
#define bFM3_GPIO_PDOR3_PF                     *((volatile unsigned int*)(0x426681BCUL))
#define bFM3_GPIO_PDOR4_P0                     *((volatile unsigned int*)(0x42668200UL))
#define bFM3_GPIO_PDOR4_P1                     *((volatile unsigned int*)(0x42668204UL))
#define bFM3_GPIO_PDOR4_P2                     *((volatile unsigned int*)(0x42668208UL))
#define bFM3_GPIO_PDOR4_P3                     *((volatile unsigned int*)(0x4266820CUL))
#define bFM3_GPIO_PDOR4_P4                     *((volatile unsigned int*)(0x42668210UL))
#define bFM3_GPIO_PDOR4_P5                     *((volatile unsigned int*)(0x42668214UL))
#define bFM3_GPIO_PDOR4_P6                     *((volatile unsigned int*)(0x42668218UL))
#define bFM3_GPIO_PDOR4_P7                     *((volatile unsigned int*)(0x4266821CUL))
#define bFM3_GPIO_PDOR4_P8                     *((volatile unsigned int*)(0x42668220UL))
#define bFM3_GPIO_PDOR4_P9                     *((volatile unsigned int*)(0x42668224UL))
#define bFM3_GPIO_PDOR4_PA                     *((volatile unsigned int*)(0x42668228UL))
#define bFM3_GPIO_PDOR4_PB                     *((volatile unsigned int*)(0x4266822CUL))
#define bFM3_GPIO_PDOR4_PC                     *((volatile unsigned int*)(0x42668230UL))
#define bFM3_GPIO_PDOR4_PD                     *((volatile unsigned int*)(0x42668234UL))
#define bFM3_GPIO_PDOR4_PE                     *((volatile unsigned int*)(0x42668238UL))
#define bFM3_GPIO_PDOR5_P0                     *((volatile unsigned int*)(0x42668280UL))
#define bFM3_GPIO_PDOR5_P1                     *((volatile unsigned int*)(0x42668284UL))
#define bFM3_GPIO_PDOR5_P2                     *((volatile unsigned int*)(0x42668288UL))
#define bFM3_GPIO_PDOR5_P3                     *((volatile unsigned int*)(0x4266828CUL))
#define bFM3_GPIO_PDOR5_P4                     *((volatile unsigned int*)(0x42668290UL))
#define bFM3_GPIO_PDOR5_P5                     *((volatile unsigned int*)(0x42668294UL))
#define bFM3_GPIO_PDOR5_P6                     *((volatile unsigned int*)(0x42668298UL))
#define bFM3_GPIO_PDOR5_P7                     *((volatile unsigned int*)(0x4266829CUL))
#define bFM3_GPIO_PDOR5_P8                     *((volatile unsigned int*)(0x426682A0UL))
#define bFM3_GPIO_PDOR5_P9                     *((volatile unsigned int*)(0x426682A4UL))
#define bFM3_GPIO_PDOR5_PA                     *((volatile unsigned int*)(0x426682A8UL))
#define bFM3_GPIO_PDOR5_PB                     *((volatile unsigned int*)(0x426682ACUL))
#define bFM3_GPIO_PDOR5_PC                     *((volatile unsigned int*)(0x426682B0UL))
#define bFM3_GPIO_PDOR5_PD                     *((volatile unsigned int*)(0x426682B4UL))
#define bFM3_GPIO_PDOR6_P0                     *((volatile unsigned int*)(0x42668300UL))
#define bFM3_GPIO_PDOR6_P1                     *((volatile unsigned int*)(0x42668304UL))
#define bFM3_GPIO_PDOR6_P2                     *((volatile unsigned int*)(0x42668308UL))
#define bFM3_GPIO_PDOR7_P0                     *((volatile unsigned int*)(0x42668380UL))
#define bFM3_GPIO_PDOR7_P1                     *((volatile unsigned int*)(0x42668384UL))
#define bFM3_GPIO_PDOR7_P2                     *((volatile unsigned int*)(0x42668388UL))
#define bFM3_GPIO_PDOR7_P3                     *((volatile unsigned int*)(0x4266838CUL))
#define bFM3_GPIO_PDOR7_P4                     *((volatile unsigned int*)(0x42668390UL))
#define bFM3_GPIO_PDOR7_P5                     *((volatile unsigned int*)(0x42668394UL))
#define bFM3_GPIO_PDOR7_P6                     *((volatile unsigned int*)(0x42668398UL))
#define bFM3_GPIO_PDOR7_P7                     *((volatile unsigned int*)(0x4266839CUL))
#define bFM3_GPIO_PDOR7_P8                     *((volatile unsigned int*)(0x426683A0UL))
#define bFM3_GPIO_PDOR7_P9                     *((volatile unsigned int*)(0x426683A4UL))
#define bFM3_GPIO_PDOR7_PA                     *((volatile unsigned int*)(0x426683A8UL))
#define bFM3_GPIO_PDOR7_PB                     *((volatile unsigned int*)(0x426683ACUL))
#define bFM3_GPIO_PDOR7_PC                     *((volatile unsigned int*)(0x426683B0UL))
#define bFM3_GPIO_PDOR7_PD                     *((volatile unsigned int*)(0x426683B4UL))
#define bFM3_GPIO_PDOR7_PE                     *((volatile unsigned int*)(0x426683B8UL))
#define bFM3_GPIO_PDOR7_PF                     *((volatile unsigned int*)(0x426683BCUL))
#define bFM3_GPIO_PDOR8_P0                     *((volatile unsigned int*)(0x42668400UL))
#define bFM3_GPIO_PDOR8_P1                     *((volatile unsigned int*)(0x42668404UL))
#define bFM3_GPIO_PDOR8_P2                     *((volatile unsigned int*)(0x42668408UL))
#define bFM3_GPIO_PDOR8_P3                     *((volatile unsigned int*)(0x4266840CUL))
#define bFM3_GPIO_PDOR9_P0                     *((volatile unsigned int*)(0x42668480UL))
#define bFM3_GPIO_PDOR9_P1                     *((volatile unsigned int*)(0x42668484UL))
#define bFM3_GPIO_PDOR9_P2                     *((volatile unsigned int*)(0x42668488UL))
#define bFM3_GPIO_PDOR9_P3                     *((volatile unsigned int*)(0x4266848CUL))
#define bFM3_GPIO_PDOR9_P4                     *((volatile unsigned int*)(0x42668490UL))
#define bFM3_GPIO_PDOR9_P5                     *((volatile unsigned int*)(0x42668494UL))
#define bFM3_GPIO_PDORA_P0                     *((volatile unsigned int*)(0x42668500UL))
#define bFM3_GPIO_PDORA_P1                     *((volatile unsigned int*)(0x42668504UL))
#define bFM3_GPIO_PDORA_P2                     *((volatile unsigned int*)(0x42668508UL))
#define bFM3_GPIO_PDORA_P3                     *((volatile unsigned int*)(0x4266850CUL))
#define bFM3_GPIO_PDORA_P4                     *((volatile unsigned int*)(0x42668510UL))
#define bFM3_GPIO_PDORA_P5                     *((volatile unsigned int*)(0x42668514UL))
#define bFM3_GPIO_PDORB_P0                     *((volatile unsigned int*)(0x42668580UL))
#define bFM3_GPIO_PDORB_P1                     *((volatile unsigned int*)(0x42668584UL))
#define bFM3_GPIO_PDORB_P2                     *((volatile unsigned int*)(0x42668588UL))
#define bFM3_GPIO_PDORB_P3                     *((volatile unsigned int*)(0x4266858CUL))
#define bFM3_GPIO_PDORB_P4                     *((volatile unsigned int*)(0x42668590UL))
#define bFM3_GPIO_PDORB_P5                     *((volatile unsigned int*)(0x42668594UL))
#define bFM3_GPIO_PDORB_P6                     *((volatile unsigned int*)(0x42668598UL))
#define bFM3_GPIO_PDORB_P7                     *((volatile unsigned int*)(0x4266859CUL))
#define bFM3_GPIO_PDORC_P0                     *((volatile unsigned int*)(0x42668600UL))
#define bFM3_GPIO_PDORC_P1                     *((volatile unsigned int*)(0x42668604UL))
#define bFM3_GPIO_PDORC_P2                     *((volatile unsigned int*)(0x42668608UL))
#define bFM3_GPIO_PDORC_P3                     *((volatile unsigned int*)(0x4266860CUL))
#define bFM3_GPIO_PDORC_P4                     *((volatile unsigned int*)(0x42668610UL))
#define bFM3_GPIO_PDORC_P5                     *((volatile unsigned int*)(0x42668614UL))
#define bFM3_GPIO_PDORC_P6                     *((volatile unsigned int*)(0x42668618UL))
#define bFM3_GPIO_PDORC_P7                     *((volatile unsigned int*)(0x4266861CUL))
#define bFM3_GPIO_PDORC_P8                     *((volatile unsigned int*)(0x42668620UL))
#define bFM3_GPIO_PDORC_P9                     *((volatile unsigned int*)(0x42668624UL))
#define bFM3_GPIO_PDORC_PA                     *((volatile unsigned int*)(0x42668628UL))
#define bFM3_GPIO_PDORC_PB                     *((volatile unsigned int*)(0x4266862CUL))
#define bFM3_GPIO_PDORC_PC                     *((volatile unsigned int*)(0x42668630UL))
#define bFM3_GPIO_PDORC_PD                     *((volatile unsigned int*)(0x42668634UL))
#define bFM3_GPIO_PDORC_PE                     *((volatile unsigned int*)(0x42668638UL))
#define bFM3_GPIO_PDORC_PF                     *((volatile unsigned int*)(0x4266863CUL))
#define bFM3_GPIO_PDORD_P0                     *((volatile unsigned int*)(0x42668680UL))
#define bFM3_GPIO_PDORD_P1                     *((volatile unsigned int*)(0x42668684UL))
#define bFM3_GPIO_PDORD_P2                     *((volatile unsigned int*)(0x42668688UL))
#define bFM3_GPIO_PDORD_P3                     *((volatile unsigned int*)(0x4266868CUL))
#define bFM3_GPIO_PDORE_P0                     *((volatile unsigned int*)(0x42668700UL))
#define bFM3_GPIO_PDORE_P2                     *((volatile unsigned int*)(0x42668708UL))
#define bFM3_GPIO_PDORE_P3                     *((volatile unsigned int*)(0x4266870CUL))
#define bFM3_GPIO_PDORF_P0                     *((volatile unsigned int*)(0x42668780UL))
#define bFM3_GPIO_PDORF_P1                     *((volatile unsigned int*)(0x42668784UL))
#define bFM3_GPIO_PDORF_P2                     *((volatile unsigned int*)(0x42668788UL))
#define bFM3_GPIO_PDORF_P3                     *((volatile unsigned int*)(0x4266878CUL))
#define bFM3_GPIO_PDORF_P4                     *((volatile unsigned int*)(0x42668790UL))
#define bFM3_GPIO_PDORF_P5                     *((volatile unsigned int*)(0x42668794UL))
#define bFM3_GPIO_PDORF_P6                     *((volatile unsigned int*)(0x42668798UL))
#define bFM3_GPIO_ADE_AN0                      *((volatile unsigned int*)(0x4266A000UL))
#define bFM3_GPIO_ADE_AN1                      *((volatile unsigned int*)(0x4266A004UL))
#define bFM3_GPIO_ADE_AN2                      *((volatile unsigned int*)(0x4266A008UL))
#define bFM3_GPIO_ADE_AN3                      *((volatile unsigned int*)(0x4266A00CUL))
#define bFM3_GPIO_ADE_AN4                      *((volatile unsigned int*)(0x4266A010UL))
