RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC0_MAR0H_A42           *((volatile unsigned int*)(0x42C80828UL))
#define bFM3_ETHERNET_MAC0_MAR0H_A43           *((volatile unsigned int*)(0x42C8082CUL))
#define bFM3_ETHERNET_MAC0_MAR0H_A44           *((volatile unsigned int*)(0x42C80830UL))
#define bFM3_ETHERNET_MAC0_MAR0H_A45           *((volatile unsigned int*)(0x42C80834UL))
#define bFM3_ETHERNET_MAC0_MAR0H_A46           *((volatile unsigned int*)(0x42C80838UL))
#define bFM3_ETHERNET_MAC0_MAR0H_A47           *((volatile unsigned int*)(0x42C8083CUL))
#define bFM3_ETHERNET_MAC0_MAR0H_MO            *((volatile unsigned int*)(0x42C8087CUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A0            *((volatile unsigned int*)(0x42C80880UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A1            *((volatile unsigned int*)(0x42C80884UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A2            *((volatile unsigned int*)(0x42C80888UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A3            *((volatile unsigned int*)(0x42C8088CUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A4            *((volatile unsigned int*)(0x42C80890UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A5            *((volatile unsigned int*)(0x42C80894UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A6            *((volatile unsigned int*)(0x42C80898UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A7            *((volatile unsigned int*)(0x42C8089CUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A8            *((volatile unsigned int*)(0x42C808A0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A9            *((volatile unsigned int*)(0x42C808A4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A10           *((volatile unsigned int*)(0x42C808A8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A11           *((volatile unsigned int*)(0x42C808ACUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A12           *((volatile unsigned int*)(0x42C808B0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A13           *((volatile unsigned int*)(0x42C808B4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A14           *((volatile unsigned int*)(0x42C808B8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A15           *((volatile unsigned int*)(0x42C808BCUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A16           *((volatile unsigned int*)(0x42C808C0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A17           *((volatile unsigned int*)(0x42C808C4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A18           *((volatile unsigned int*)(0x42C808C8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A19           *((volatile unsigned int*)(0x42C808CCUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A20           *((volatile unsigned int*)(0x42C808D0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A21           *((volatile unsigned int*)(0x42C808D4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A22           *((volatile unsigned int*)(0x42C808D8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A23           *((volatile unsigned int*)(0x42C808DCUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A24           *((volatile unsigned int*)(0x42C808E0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A25           *((volatile unsigned int*)(0x42C808E4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A26           *((volatile unsigned int*)(0x42C808E8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A27           *((volatile unsigned int*)(0x42C808ECUL))
#define bFM3_ETHERNET_MAC0_MAR0L_A28           *((volatile unsigned int*)(0x42C808F0UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A29           *((volatile unsigned int*)(0x42C808F4UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A30           *((volatile unsigned int*)(0x42C808F8UL))
#define bFM3_ETHERNET_MAC0_MAR0L_A31           *((volatile unsigned int*)(0x42C808FCUL))
#define bFM3_ETHERNET_MAC0_MAR1H_A32           *((volatile unsigned int*)(0x42C80900UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A33           *((volatile unsigned int*)(0x42C80904UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A34           *((volatile unsigned int*)(0x42C80908UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A35           *((volatile unsigned int*)(0x42C8090CUL))
#define bFM3_ETHERNET_MAC0_MAR1H_A36           *((volatile unsigned int*)(0x42C80910UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A37           *((volatile unsigned int*)(0x42C80914UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A38           *((volatile unsigned int*)(0x42C80918UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A39           *((volatile unsigned int*)(0x42C8091CUL))
#define bFM3_ETHERNET_MAC0_MAR1H_A40           *((volatile unsigned int*)(0x42C80920UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A41           *((volatile unsigned int*)(0x42C80924UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A42           *((volatile unsigned int*)(0x42C80928UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A43           *((volatile unsigned int*)(0x42C8092CUL))
#define bFM3_ETHERNET_MAC0_MAR1H_A44           *((volatile unsigned int*)(0x42C80930UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A45           *((volatile unsigned int*)(0x42C80934UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A46           *((volatile unsigned int*)(0x42C80938UL))
#define bFM3_ETHERNET_MAC0_MAR1H_A47           *((volatile unsigned int*)(0x42C8093CUL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC0          *((volatile unsigned int*)(0x42C80960UL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC1          *((volatile unsigned int*)(0x42C80964UL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC2          *((volatile unsigned int*)(0x42C80968UL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC3          *((volatile unsigned int*)(0x42C8096CUL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC4          *((volatile unsigned int*)(0x42C80970UL))
#define bFM3_ETHERNET_MAC0_MAR1H_MBC5          *((volatile unsigned int*)(0x42C80974UL))
#define bFM3_ETHERNET_MAC0_MAR1H_SA            *((volatile unsigned int*)(0x42C80978UL))
#define bFM3_ETHERNET_MAC0_MAR1H_AE            *((volatile unsigned int*)(0x42C8097CUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A0            *((volatile unsigned int*)(0x42C80980UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A1            *((volatile unsigned int*)(0x42C80984UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A2            *((volatile unsigned int*)(0x42C80988UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A3            *((volatile unsigned int*)(0x42C8098CUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A4            *((volatile unsigned int*)(0x42C80990UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A5            *((volatile unsigned int*)(0x42C80994UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A6            *((volatile unsigned int*)(0x42C80998UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A7            *((volatile unsigned int*)(0x42C8099CUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A8            *((volatile unsigned int*)(0x42C809A0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A9            *((volatile unsigned int*)(0x42C809A4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A10           *((volatile unsigned int*)(0x42C809A8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A11           *((volatile unsigned int*)(0x42C809ACUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A12           *((volatile unsigned int*)(0x42C809B0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A13           *((volatile unsigned int*)(0x42C809B4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A14           *((volatile unsigned int*)(0x42C809B8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A15           *((volatile unsigned int*)(0x42C809BCUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A16           *((volatile unsigned int*)(0x42C809C0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A17           *((volatile unsigned int*)(0x42C809C4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A18           *((volatile unsigned int*)(0x42C809C8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A19           *((volatile unsigned int*)(0x42C809CCUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A20           *((volatile unsigned int*)(0x42C809D0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A21           *((volatile unsigned int*)(0x42C809D4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A22           *((volatile unsigned int*)(0x42C809D8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A23           *((volatile unsigned int*)(0x42C809DCUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A24           *((volatile unsigned int*)(0x42C809E0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A25           *((volatile unsigned int*)(0x42C809E4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A26           *((volatile unsigned int*)(0x42C809E8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A27           *((volatile unsigned int*)(0x42C809ECUL))
#define bFM3_ETHERNET_MAC0_MAR1L_A28           *((volatile unsigned int*)(0x42C809F0UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A29           *((volatile unsigned int*)(0x42C809F4UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A30           *((volatile unsigned int*)(0x42C809F8UL))
#define bFM3_ETHERNET_MAC0_MAR1L_A31           *((volatile unsigned int*)(0x42C809FCUL))
#define bFM3_ETHERNET_MAC0_MAR2H_A32           *((volatile unsigned int*)(0x42C80A00UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A33           *((volatile unsigned int*)(0x42C80A04UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A34           *((volatile unsigned int*)(0x42C80A08UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A35           *((volatile unsigned int*)(0x42C80A0CUL))
#define bFM3_ETHERNET_MAC0_MAR2H_A36           *((volatile unsigned int*)(0x42C80A10UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A37           *((volatile unsigned int*)(0x42C80A14UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A38           *((volatile unsigned int*)(0x42C80A18UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A39           *((volatile unsigned int*)(0x42C80A1CUL))
#define bFM3_ETHERNET_MAC0_MAR2H_A40           *((volatile unsigned int*)(0x42C80A20UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A41           *((volatile unsigned int*)(0x42C80A24UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A42           *((volatile unsigned int*)(0x42C80A28UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A43           *((volatile unsigned int*)(0x42C80A2CUL))
#define bFM3_ETHERNET_MAC0_MAR2H_A44           *((volatile unsigned int*)(0x42C80A30UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A45           *((volatile unsigned int*)(0x42C80A34UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A46           *((volatile unsigned int*)(0x42C80A38UL))
#define bFM3_ETHERNET_MAC0_MAR2H_A47           *((volatile unsigned int*)(0x42C80A3CUL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC0          *((volatile unsigned int*)(0x42C80A60UL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC1          *((volatile unsigned int*)(0x42C80A64UL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC2          *((volatile unsigned int*)(0x42C80A68UL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC3          *((volatile unsigned int*)(0x42C80A6CUL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC4          *((volatile unsigned int*)(0x42C80A70UL))
#define bFM3_ETHERNET_MAC0_MAR2H_MBC5          *((volatile unsigned int*)(0x42C80A74UL))
#define bFM3_ETHERNET_MAC0_MAR2H_SA            *((volatile unsigned int*)(0x42C80A78UL))
#define bFM3_ETHERNET_MAC0_MAR2H_AE            *((volatile unsigned int*)(0x42C80A7CUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A0            *((volatile unsigned int*)(0x42C80A80UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A1            *((volatile unsigned int*)(0x42C80A84UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A2            *((volatile unsigned int*)(0x42C80A88UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A3            *((volatile unsigned int*)(0x42C80A8CUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A4            *((volatile unsigned int*)(0x42C80A90UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A5            *((volatile unsigned int*)(0x42C80A94UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A6            *((volatile unsigned int*)(0x42C80A98UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A7            *((volatile unsigned int*)(0x42C80A9CUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A8            *((volatile unsigned int*)(0x42C80AA0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A9            *((volatile unsigned int*)(0x42C80AA4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A10           *((volatile unsigned int*)(0x42C80AA8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A11           *((volatile unsigned int*)(0x42C80AACUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A12           *((volatile unsigned int*)(0x42C80AB0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A13           *((volatile unsigned int*)(0x42C80AB4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A14           *((volatile unsigned int*)(0x42C80AB8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A15           *((volatile unsigned int*)(0x42C80ABCUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A16           *((volatile unsigned int*)(0x42C80AC0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A17           *((volatile unsigned int*)(0x42C80AC4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A18           *((volatile unsigned int*)(0x42C80AC8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A19           *((volatile unsigned int*)(0x42C80ACCUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A20           *((volatile unsigned int*)(0x42C80AD0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A21           *((volatile unsigned int*)(0x42C80AD4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A22           *((volatile unsigned int*)(0x42C80AD8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A23           *((volatile unsigned int*)(0x42C80ADCUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A24           *((volatile unsigned int*)(0x42C80AE0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A25           *((volatile unsigned int*)(0x42C80AE4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A26           *((volatile unsigned int*)(0x42C80AE8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A27           *((volatile unsigned int*)(0x42C80AECUL))
#define bFM3_ETHERNET_MAC0_MAR2L_A28           *((volatile unsigned int*)(0x42C80AF0UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A29           *((volatile unsigned int*)(0x42C80AF4UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A30           *((volatile unsigned int*)(0x42C80AF8UL))
#define bFM3_ETHERNET_MAC0_MAR2L_A31           *((volatile unsigned int*)(0x42C80AFCUL))
#define bFM3_ETHERNET_MAC0_MAR3H_A32           *((volatile unsigned int*)(0x42C80B00UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A33           *((volatile unsigned int*)(0x42C80B04UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A34           *((volatile unsigned int*)(0x42C80B08UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A35           *((volatile unsigned int*)(0x42C80B0CUL))
#define bFM3_ETHERNET_MAC0_MAR3H_A36           *((volatile unsigned int*)(0x42C80B10UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A37           *((volatile unsigned int*)(0x42C80B14UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A38           *((volatile unsigned int*)(0x42C80B18UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A39           *((volatile unsigned int*)(0x42C80B1CUL))
#define bFM3_ETHERNET_MAC0_MAR3H_A40           *((volatile unsigned int*)(0x42C80B20UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A41           *((volatile unsigned int*)(0x42C80B24UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A42           *((volatile unsigned int*)(0x42C80B28UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A43           *((volatile unsigned int*)(0x42C80B2CUL))
#define bFM3_ETHERNET_MAC0_MAR3H_A44           *((volatile unsigned int*)(0x42C80B30UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A45           *((volatile unsigned int*)(0x42C80B34UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A46           *((volatile unsigned int*)(0x42C80B38UL))
#define bFM3_ETHERNET_MAC0_MAR3H_A47           *((volatile unsigned int*)(0x42C80B3CUL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC0          *((volatile unsigned int*)(0x42C80B60UL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC1          *((volatile unsigned int*)(0x42C80B64UL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC2          *((volatile unsigned int*)(0x42C80B68UL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC3          *((volatile unsigned int*)(0x42C80B6CUL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC4          *((volatile unsigned int*)(0x42C80B70UL))
#define bFM3_ETHERNET_MAC0_MAR3H_MBC5          *((volatile unsigned int*)(0x42C80B74UL))
#define bFM3_ETHERNET_MAC0_MAR3H_SA            *((volatile unsigned int*)(0x42C80B78UL))
#define bFM3_ETHERNET_MAC0_MAR3H_AE            *((volatile unsigned int*)(0x42C80B7CUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A0            *((volatile unsigned int*)(0x42C80B80UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A1            *((volatile unsigned int*)(0x42C80B84UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A2            *((volatile unsigned int*)(0x42C80B88UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A3            *((volatile unsigned int*)(0x42C80B8CUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A4            *((volatile unsigned int*)(0x42C80B90UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A5            *((volatile unsigned int*)(0x42C80B94UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A6            *((volatile unsigned int*)(0x42C80B98UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A7            *((volatile unsigned int*)(0x42C80B9CUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A8            *((volatile unsigned int*)(0x42C80BA0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A9            *((volatile unsigned int*)(0x42C80BA4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A10           *((volatile unsigned int*)(0x42C80BA8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A11           *((volatile unsigned int*)(0x42C80BACUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A12           *((volatile unsigned int*)(0x42C80BB0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A13           *((volatile unsigned int*)(0x42C80BB4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A14           *((volatile unsigned int*)(0x42C80BB8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A15           *((volatile unsigned int*)(0x42C80BBCUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A16           *((volatile unsigned int*)(0x42C80BC0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A17           *((volatile unsigned int*)(0x42C80BC4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A18           *((volatile unsigned int*)(0x42C80BC8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A19           *((volatile unsigned int*)(0x42C80BCCUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A20           *((volatile unsigned int*)(0x42C80BD0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A21           *((volatile unsigned int*)(0x42C80BD4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A22           *((volatile unsigned int*)(0x42C80BD8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A23           *((volatile unsigned int*)(0x42C80BDCUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A24           *((volatile unsigned int*)(0x42C80BE0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A25           *((volatile unsigned int*)(0x42C80BE4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A26           *((volatile unsigned int*)(0x42C80BE8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A27           *((volatile unsigned int*)(0x42C80BECUL))
#define bFM3_ETHERNET_MAC0_MAR3L_A28           *((volatile unsigned int*)(0x42C80BF0UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A29           *((volatile unsigned int*)(0x42C80BF4UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A30           *((volatile unsigned int*)(0x42C80BF8UL))
#define bFM3_ETHERNET_MAC0_MAR3L_A31           *((volatile unsigned int*)(0x42C80BFCUL))
#define bFM3_ETHERNET_MAC0_MAR4H_A32           *((volatile unsigned int*)(0x42C80C00UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A33           *((volatile unsigned int*)(0x42C80C04UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A34           *((volatile unsigned int*)(0x42C80C08UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A35           *((volatile unsigned int*)(0x42C80C0CUL))
#define bFM3_ETHERNET_MAC0_MAR4H_A36           *((volatile unsigned int*)(0x42C80C10UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A37           *((volatile unsigned int*)(0x42C80C14UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A38           *((volatile unsigned int*)(0x42C80C18UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A39           *((volatile unsigned int*)(0x42C80C1CUL))
#define bFM3_ETHERNET_MAC0_MAR4H_A40           *((volatile unsigned int*)(0x42C80C20UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A41           *((volatile unsigned int*)(0x42C80C24UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A42           *((volatile unsigned int*)(0x42C80C28UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A43           *((volatile unsigned int*)(0x42C80C2CUL))
#define bFM3_ETHERNET_MAC0_MAR4H_A44           *((volatile unsigned int*)(0x42C80C30UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A45           *((volatile unsigned int*)(0x42C80C34UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A46           *((volatile unsigned int*)(0x42C80C38UL))
#define bFM3_ETHERNET_MAC0_MAR4H_A47           *((volatile unsigned int*)(0x42C80C3CUL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC0          *((volatile unsigned int*)(0x42C80C60UL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC1          *((volatile unsigned int*)(0x42C80C64UL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC2          *((volatile unsigned int*)(0x42C80C68UL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC3          *((volatile unsigned int*)(0x42C80C6CUL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC4          *((volatile unsigned int*)(0x42C80C70UL))
#define bFM3_ETHERNET_MAC0_MAR4H_MBC5          *((volatile unsigned int*)(0x42C80C74UL))
#define bFM3_ETHERNET_MAC0_MAR4H_SA            *((volatile unsigned int*)(0x42C80C78UL))
#define bFM3_ETHERNET_MAC0_MAR4H_AE            *((volatile unsigned int*)(0x42C80C7CUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A0            *((volatile unsigned int*)(0x42C80C80UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A1            *((volatile unsigned int*)(0x42C80C84UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A2            *((volatile unsigned int*)(0x42C80C88UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A3            *((volatile unsigned int*)(0x42C80C8CUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A4            *((volatile unsigned int*)(0x42C80C90UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A5            *((volatile unsigned int*)(0x42C80C94UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A6            *((volatile unsigned int*)(0x42C80C98UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A7            *((volatile unsigned int*)(0x42C80C9CUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A8            *((volatile unsigned int*)(0x42C80CA0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A9            *((volatile unsigned int*)(0x42C80CA4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A10           *((volatile unsigned int*)(0x42C80CA8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A11           *((volatile unsigned int*)(0x42C80CACUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A12           *((volatile unsigned int*)(0x42C80CB0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A13           *((volatile unsigned int*)(0x42C80CB4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A14           *((volatile unsigned int*)(0x42C80CB8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A15           *((volatile unsigned int*)(0x42C80CBCUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A16           *((volatile unsigned int*)(0x42C80CC0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A17           *((volatile unsigned int*)(0x42C80CC4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A18           *((volatile unsigned int*)(0x42C80CC8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A19           *((volatile unsigned int*)(0x42C80CCCUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A20           *((volatile unsigned int*)(0x42C80CD0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A21           *((volatile unsigned int*)(0x42C80CD4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A22           *((volatile unsigned int*)(0x42C80CD8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A23           *((volatile unsigned int*)(0x42C80CDCUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A24           *((volatile unsigned int*)(0x42C80CE0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A25           *((volatile unsigned int*)(0x42C80CE4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A26           *((volatile unsigned int*)(0x42C80CE8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A27           *((volatile unsigned int*)(0x42C80CECUL))
#define bFM3_ETHERNET_MAC0_MAR4L_A28           *((volatile unsigned int*)(0x42C80CF0UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A29           *((volatile unsigned int*)(0x42C80CF4UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A30           *((volatile unsigned int*)(0x42C80CF8UL))
#define bFM3_ETHERNET_MAC0_MAR4L_A31           *((volatile unsigned int*)(0x42C80CFCUL))
#define bFM3_ETHERNET_MAC0_MAR5H_A32           *((volatile unsigned int*)(0x42C80D00UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A33           *((volatile unsigned int*)(0x42C80D04UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A34           *((volatile unsigned int*)(0x42C80D08UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A35           *((volatile unsigned int*)(0x42C80D0CUL))
#define bFM3_ETHERNET_MAC0_MAR5H_A36           *((volatile unsigned int*)(0x42C80D10UL))
#define bFM3_ETHERNET_MAC0_MAR5H_A37           *((volatile unsigned int*)(0x42C80D14UL))
