RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC0_MAR18H_A43          *((volatile unsigned int*)(0x42C9022CUL))
#define bFM3_ETHERNET_MAC0_MAR18H_A44          *((volatile unsigned int*)(0x42C90230UL))
#define bFM3_ETHERNET_MAC0_MAR18H_A45          *((volatile unsigned int*)(0x42C90234UL))
#define bFM3_ETHERNET_MAC0_MAR18H_A46          *((volatile unsigned int*)(0x42C90238UL))
#define bFM3_ETHERNET_MAC0_MAR18H_A47          *((volatile unsigned int*)(0x42C9023CUL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC0         *((volatile unsigned int*)(0x42C90260UL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC1         *((volatile unsigned int*)(0x42C90264UL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC2         *((volatile unsigned int*)(0x42C90268UL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC3         *((volatile unsigned int*)(0x42C9026CUL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC4         *((volatile unsigned int*)(0x42C90270UL))
#define bFM3_ETHERNET_MAC0_MAR18H_MBC5         *((volatile unsigned int*)(0x42C90274UL))
#define bFM3_ETHERNET_MAC0_MAR18H_SA           *((volatile unsigned int*)(0x42C90278UL))
#define bFM3_ETHERNET_MAC0_MAR18H_AE           *((volatile unsigned int*)(0x42C9027CUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A0           *((volatile unsigned int*)(0x42C90280UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A1           *((volatile unsigned int*)(0x42C90284UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A2           *((volatile unsigned int*)(0x42C90288UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A3           *((volatile unsigned int*)(0x42C9028CUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A4           *((volatile unsigned int*)(0x42C90290UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A5           *((volatile unsigned int*)(0x42C90294UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A6           *((volatile unsigned int*)(0x42C90298UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A7           *((volatile unsigned int*)(0x42C9029CUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A8           *((volatile unsigned int*)(0x42C902A0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A9           *((volatile unsigned int*)(0x42C902A4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A10          *((volatile unsigned int*)(0x42C902A8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A11          *((volatile unsigned int*)(0x42C902ACUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A12          *((volatile unsigned int*)(0x42C902B0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A13          *((volatile unsigned int*)(0x42C902B4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A14          *((volatile unsigned int*)(0x42C902B8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A15          *((volatile unsigned int*)(0x42C902BCUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A16          *((volatile unsigned int*)(0x42C902C0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A17          *((volatile unsigned int*)(0x42C902C4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A18          *((volatile unsigned int*)(0x42C902C8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A19          *((volatile unsigned int*)(0x42C902CCUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A20          *((volatile unsigned int*)(0x42C902D0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A21          *((volatile unsigned int*)(0x42C902D4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A22          *((volatile unsigned int*)(0x42C902D8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A23          *((volatile unsigned int*)(0x42C902DCUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A24          *((volatile unsigned int*)(0x42C902E0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A25          *((volatile unsigned int*)(0x42C902E4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A26          *((volatile unsigned int*)(0x42C902E8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A27          *((volatile unsigned int*)(0x42C902ECUL))
#define bFM3_ETHERNET_MAC0_MAR18L_A28          *((volatile unsigned int*)(0x42C902F0UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A29          *((volatile unsigned int*)(0x42C902F4UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A30          *((volatile unsigned int*)(0x42C902F8UL))
#define bFM3_ETHERNET_MAC0_MAR18L_A31          *((volatile unsigned int*)(0x42C902FCUL))
#define bFM3_ETHERNET_MAC0_MAR19H_A32          *((volatile unsigned int*)(0x42C90300UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A33          *((volatile unsigned int*)(0x42C90304UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A34          *((volatile unsigned int*)(0x42C90308UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A35          *((volatile unsigned int*)(0x42C9030CUL))
#define bFM3_ETHERNET_MAC0_MAR19H_A36          *((volatile unsigned int*)(0x42C90310UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A37          *((volatile unsigned int*)(0x42C90314UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A38          *((volatile unsigned int*)(0x42C90318UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A39          *((volatile unsigned int*)(0x42C9031CUL))
#define bFM3_ETHERNET_MAC0_MAR19H_A40          *((volatile unsigned int*)(0x42C90320UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A41          *((volatile unsigned int*)(0x42C90324UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A42          *((volatile unsigned int*)(0x42C90328UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A43          *((volatile unsigned int*)(0x42C9032CUL))
#define bFM3_ETHERNET_MAC0_MAR19H_A44          *((volatile unsigned int*)(0x42C90330UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A45          *((volatile unsigned int*)(0x42C90334UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A46          *((volatile unsigned int*)(0x42C90338UL))
#define bFM3_ETHERNET_MAC0_MAR19H_A47          *((volatile unsigned int*)(0x42C9033CUL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC0         *((volatile unsigned int*)(0x42C90360UL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC1         *((volatile unsigned int*)(0x42C90364UL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC2         *((volatile unsigned int*)(0x42C90368UL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC3         *((volatile unsigned int*)(0x42C9036CUL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC4         *((volatile unsigned int*)(0x42C90370UL))
#define bFM3_ETHERNET_MAC0_MAR19H_MBC5         *((volatile unsigned int*)(0x42C90374UL))
#define bFM3_ETHERNET_MAC0_MAR19H_SA           *((volatile unsigned int*)(0x42C90378UL))
#define bFM3_ETHERNET_MAC0_MAR19H_AE           *((volatile unsigned int*)(0x42C9037CUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A0           *((volatile unsigned int*)(0x42C90380UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A1           *((volatile unsigned int*)(0x42C90384UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A2           *((volatile unsigned int*)(0x42C90388UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A3           *((volatile unsigned int*)(0x42C9038CUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A4           *((volatile unsigned int*)(0x42C90390UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A5           *((volatile unsigned int*)(0x42C90394UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A6           *((volatile unsigned int*)(0x42C90398UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A7           *((volatile unsigned int*)(0x42C9039CUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A8           *((volatile unsigned int*)(0x42C903A0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A9           *((volatile unsigned int*)(0x42C903A4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A10          *((volatile unsigned int*)(0x42C903A8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A11          *((volatile unsigned int*)(0x42C903ACUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A12          *((volatile unsigned int*)(0x42C903B0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A13          *((volatile unsigned int*)(0x42C903B4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A14          *((volatile unsigned int*)(0x42C903B8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A15          *((volatile unsigned int*)(0x42C903BCUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A16          *((volatile unsigned int*)(0x42C903C0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A17          *((volatile unsigned int*)(0x42C903C4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A18          *((volatile unsigned int*)(0x42C903C8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A19          *((volatile unsigned int*)(0x42C903CCUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A20          *((volatile unsigned int*)(0x42C903D0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A21          *((volatile unsigned int*)(0x42C903D4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A22          *((volatile unsigned int*)(0x42C903D8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A23          *((volatile unsigned int*)(0x42C903DCUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A24          *((volatile unsigned int*)(0x42C903E0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A25          *((volatile unsigned int*)(0x42C903E4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A26          *((volatile unsigned int*)(0x42C903E8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A27          *((volatile unsigned int*)(0x42C903ECUL))
#define bFM3_ETHERNET_MAC0_MAR19L_A28          *((volatile unsigned int*)(0x42C903F0UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A29          *((volatile unsigned int*)(0x42C903F4UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A30          *((volatile unsigned int*)(0x42C903F8UL))
#define bFM3_ETHERNET_MAC0_MAR19L_A31          *((volatile unsigned int*)(0x42C903FCUL))
#define bFM3_ETHERNET_MAC0_MAR20H_A32          *((volatile unsigned int*)(0x42C90400UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A33          *((volatile unsigned int*)(0x42C90404UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A34          *((volatile unsigned int*)(0x42C90408UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A35          *((volatile unsigned int*)(0x42C9040CUL))
#define bFM3_ETHERNET_MAC0_MAR20H_A36          *((volatile unsigned int*)(0x42C90410UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A37          *((volatile unsigned int*)(0x42C90414UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A38          *((volatile unsigned int*)(0x42C90418UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A39          *((volatile unsigned int*)(0x42C9041CUL))
#define bFM3_ETHERNET_MAC0_MAR20H_A40          *((volatile unsigned int*)(0x42C90420UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A41          *((volatile unsigned int*)(0x42C90424UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A42          *((volatile unsigned int*)(0x42C90428UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A43          *((volatile unsigned int*)(0x42C9042CUL))
#define bFM3_ETHERNET_MAC0_MAR20H_A44          *((volatile unsigned int*)(0x42C90430UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A45          *((volatile unsigned int*)(0x42C90434UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A46          *((volatile unsigned int*)(0x42C90438UL))
#define bFM3_ETHERNET_MAC0_MAR20H_A47          *((volatile unsigned int*)(0x42C9043CUL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC0         *((volatile unsigned int*)(0x42C90460UL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC1         *((volatile unsigned int*)(0x42C90464UL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC2         *((volatile unsigned int*)(0x42C90468UL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC3         *((volatile unsigned int*)(0x42C9046CUL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC4         *((volatile unsigned int*)(0x42C90470UL))
#define bFM3_ETHERNET_MAC0_MAR20H_MBC5         *((volatile unsigned int*)(0x42C90474UL))
#define bFM3_ETHERNET_MAC0_MAR20H_SA           *((volatile unsigned int*)(0x42C90478UL))
#define bFM3_ETHERNET_MAC0_MAR20H_AE           *((volatile unsigned int*)(0x42C9047CUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A0           *((volatile unsigned int*)(0x42C90480UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A1           *((volatile unsigned int*)(0x42C90484UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A2           *((volatile unsigned int*)(0x42C90488UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A3           *((volatile unsigned int*)(0x42C9048CUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A4           *((volatile unsigned int*)(0x42C90490UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A5           *((volatile unsigned int*)(0x42C90494UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A6           *((volatile unsigned int*)(0x42C90498UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A7           *((volatile unsigned int*)(0x42C9049CUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A8           *((volatile unsigned int*)(0x42C904A0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A9           *((volatile unsigned int*)(0x42C904A4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A10          *((volatile unsigned int*)(0x42C904A8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A11          *((volatile unsigned int*)(0x42C904ACUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A12          *((volatile unsigned int*)(0x42C904B0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A13          *((volatile unsigned int*)(0x42C904B4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A14          *((volatile unsigned int*)(0x42C904B8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A15          *((volatile unsigned int*)(0x42C904BCUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A16          *((volatile unsigned int*)(0x42C904C0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A17          *((volatile unsigned int*)(0x42C904C4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A18          *((volatile unsigned int*)(0x42C904C8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A19          *((volatile unsigned int*)(0x42C904CCUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A20          *((volatile unsigned int*)(0x42C904D0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A21          *((volatile unsigned int*)(0x42C904D4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A22          *((volatile unsigned int*)(0x42C904D8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A23          *((volatile unsigned int*)(0x42C904DCUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A24          *((volatile unsigned int*)(0x42C904E0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A25          *((volatile unsigned int*)(0x42C904E4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A26          *((volatile unsigned int*)(0x42C904E8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A27          *((volatile unsigned int*)(0x42C904ECUL))
#define bFM3_ETHERNET_MAC0_MAR20L_A28          *((volatile unsigned int*)(0x42C904F0UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A29          *((volatile unsigned int*)(0x42C904F4UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A30          *((volatile unsigned int*)(0x42C904F8UL))
#define bFM3_ETHERNET_MAC0_MAR20L_A31          *((volatile unsigned int*)(0x42C904FCUL))
#define bFM3_ETHERNET_MAC0_MAR21H_A32          *((volatile unsigned int*)(0x42C90500UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A33          *((volatile unsigned int*)(0x42C90504UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A34          *((volatile unsigned int*)(0x42C90508UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A35          *((volatile unsigned int*)(0x42C9050CUL))
#define bFM3_ETHERNET_MAC0_MAR21H_A36          *((volatile unsigned int*)(0x42C90510UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A37          *((volatile unsigned int*)(0x42C90514UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A38          *((volatile unsigned int*)(0x42C90518UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A39          *((volatile unsigned int*)(0x42C9051CUL))
#define bFM3_ETHERNET_MAC0_MAR21H_A40          *((volatile unsigned int*)(0x42C90520UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A41          *((volatile unsigned int*)(0x42C90524UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A42          *((volatile unsigned int*)(0x42C90528UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A43          *((volatile unsigned int*)(0x42C9052CUL))
#define bFM3_ETHERNET_MAC0_MAR21H_A44          *((volatile unsigned int*)(0x42C90530UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A45          *((volatile unsigned int*)(0x42C90534UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A46          *((volatile unsigned int*)(0x42C90538UL))
#define bFM3_ETHERNET_MAC0_MAR21H_A47          *((volatile unsigned int*)(0x42C9053CUL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC0         *((volatile unsigned int*)(0x42C90560UL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC1         *((volatile unsigned int*)(0x42C90564UL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC2         *((volatile unsigned int*)(0x42C90568UL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC3         *((volatile unsigned int*)(0x42C9056CUL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC4         *((volatile unsigned int*)(0x42C90570UL))
#define bFM3_ETHERNET_MAC0_MAR21H_MBC5         *((volatile unsigned int*)(0x42C90574UL))
#define bFM3_ETHERNET_MAC0_MAR21H_SA           *((volatile unsigned int*)(0x42C90578UL))
#define bFM3_ETHERNET_MAC0_MAR21H_AE           *((volatile unsigned int*)(0x42C9057CUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A0           *((volatile unsigned int*)(0x42C90580UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A1           *((volatile unsigned int*)(0x42C90584UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A2           *((volatile unsigned int*)(0x42C90588UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A3           *((volatile unsigned int*)(0x42C9058CUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A4           *((volatile unsigned int*)(0x42C90590UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A5           *((volatile unsigned int*)(0x42C90594UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A6           *((volatile unsigned int*)(0x42C90598UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A7           *((volatile unsigned int*)(0x42C9059CUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A8           *((volatile unsigned int*)(0x42C905A0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A9           *((volatile unsigned int*)(0x42C905A4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A10          *((volatile unsigned int*)(0x42C905A8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A11          *((volatile unsigned int*)(0x42C905ACUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A12          *((volatile unsigned int*)(0x42C905B0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A13          *((volatile unsigned int*)(0x42C905B4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A14          *((volatile unsigned int*)(0x42C905B8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A15          *((volatile unsigned int*)(0x42C905BCUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A16          *((volatile unsigned int*)(0x42C905C0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A17          *((volatile unsigned int*)(0x42C905C4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A18          *((volatile unsigned int*)(0x42C905C8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A19          *((volatile unsigned int*)(0x42C905CCUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A20          *((volatile unsigned int*)(0x42C905D0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A21          *((volatile unsigned int*)(0x42C905D4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A22          *((volatile unsigned int*)(0x42C905D8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A23          *((volatile unsigned int*)(0x42C905DCUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A24          *((volatile unsigned int*)(0x42C905E0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A25          *((volatile unsigned int*)(0x42C905E4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A26          *((volatile unsigned int*)(0x42C905E8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A27          *((volatile unsigned int*)(0x42C905ECUL))
#define bFM3_ETHERNET_MAC0_MAR21L_A28          *((volatile unsigned int*)(0x42C905F0UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A29          *((volatile unsigned int*)(0x42C905F4UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A30          *((volatile unsigned int*)(0x42C905F8UL))
#define bFM3_ETHERNET_MAC0_MAR21L_A31          *((volatile unsigned int*)(0x42C905FCUL))
#define bFM3_ETHERNET_MAC0_MAR22H_A32          *((volatile unsigned int*)(0x42C90600UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A33          *((volatile unsigned int*)(0x42C90604UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A34          *((volatile unsigned int*)(0x42C90608UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A35          *((volatile unsigned int*)(0x42C9060CUL))
#define bFM3_ETHERNET_MAC0_MAR22H_A36          *((volatile unsigned int*)(0x42C90610UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A37          *((volatile unsigned int*)(0x42C90614UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A38          *((volatile unsigned int*)(0x42C90618UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A39          *((volatile unsigned int*)(0x42C9061CUL))
#define bFM3_ETHERNET_MAC0_MAR22H_A40          *((volatile unsigned int*)(0x42C90620UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A41          *((volatile unsigned int*)(0x42C90624UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A42          *((volatile unsigned int*)(0x42C90628UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A43          *((volatile unsigned int*)(0x42C9062CUL))
#define bFM3_ETHERNET_MAC0_MAR22H_A44          *((volatile unsigned int*)(0x42C90630UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A45          *((volatile unsigned int*)(0x42C90634UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A46          *((volatile unsigned int*)(0x42C90638UL))
#define bFM3_ETHERNET_MAC0_MAR22H_A47          *((volatile unsigned int*)(0x42C9063CUL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC0         *((volatile unsigned int*)(0x42C90660UL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC1         *((volatile unsigned int*)(0x42C90664UL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC2         *((volatile unsigned int*)(0x42C90668UL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC3         *((volatile unsigned int*)(0x42C9066CUL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC4         *((volatile unsigned int*)(0x42C90670UL))
#define bFM3_ETHERNET_MAC0_MAR22H_MBC5         *((volatile unsigned int*)(0x42C90674UL))
#define bFM3_ETHERNET_MAC0_MAR22H_SA           *((volatile unsigned int*)(0x42C90678UL))
#define bFM3_ETHERNET_MAC0_MAR22H_AE           *((volatile unsigned int*)(0x42C9067CUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A0           *((volatile unsigned int*)(0x42C90680UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A1           *((volatile unsigned int*)(0x42C90684UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A2           *((volatile unsigned int*)(0x42C90688UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A3           *((volatile unsigned int*)(0x42C9068CUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A4           *((volatile unsigned int*)(0x42C90690UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A5           *((volatile unsigned int*)(0x42C90694UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A6           *((volatile unsigned int*)(0x42C90698UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A7           *((volatile unsigned int*)(0x42C9069CUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A8           *((volatile unsigned int*)(0x42C906A0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A9           *((volatile unsigned int*)(0x42C906A4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A10          *((volatile unsigned int*)(0x42C906A8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A11          *((volatile unsigned int*)(0x42C906ACUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A12          *((volatile unsigned int*)(0x42C906B0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A13          *((volatile unsigned int*)(0x42C906B4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A14          *((volatile unsigned int*)(0x42C906B8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A15          *((volatile unsigned int*)(0x42C906BCUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A16          *((volatile unsigned int*)(0x42C906C0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A17          *((volatile unsigned int*)(0x42C906C4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A18          *((volatile unsigned int*)(0x42C906C8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A19          *((volatile unsigned int*)(0x42C906CCUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A20          *((volatile unsigned int*)(0x42C906D0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A21          *((volatile unsigned int*)(0x42C906D4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A22          *((volatile unsigned int*)(0x42C906D8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A23          *((volatile unsigned int*)(0x42C906DCUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A24          *((volatile unsigned int*)(0x42C906E0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A25          *((volatile unsigned int*)(0x42C906E4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A26          *((volatile unsigned int*)(0x42C906E8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A27          *((volatile unsigned int*)(0x42C906ECUL))
#define bFM3_ETHERNET_MAC0_MAR22L_A28          *((volatile unsigned int*)(0x42C906F0UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A29          *((volatile unsigned int*)(0x42C906F4UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A30          *((volatile unsigned int*)(0x42C906F8UL))
#define bFM3_ETHERNET_MAC0_MAR22L_A31          *((volatile unsigned int*)(0x42C906FCUL))
