RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC0_MAR23H_A32          *((volatile unsigned int*)(0x42C90700UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A33          *((volatile unsigned int*)(0x42C90704UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A34          *((volatile unsigned int*)(0x42C90708UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A35          *((volatile unsigned int*)(0x42C9070CUL))
#define bFM3_ETHERNET_MAC0_MAR23H_A36          *((volatile unsigned int*)(0x42C90710UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A37          *((volatile unsigned int*)(0x42C90714UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A38          *((volatile unsigned int*)(0x42C90718UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A39          *((volatile unsigned int*)(0x42C9071CUL))
#define bFM3_ETHERNET_MAC0_MAR23H_A40          *((volatile unsigned int*)(0x42C90720UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A41          *((volatile unsigned int*)(0x42C90724UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A42          *((volatile unsigned int*)(0x42C90728UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A43          *((volatile unsigned int*)(0x42C9072CUL))
#define bFM3_ETHERNET_MAC0_MAR23H_A44          *((volatile unsigned int*)(0x42C90730UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A45          *((volatile unsigned int*)(0x42C90734UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A46          *((volatile unsigned int*)(0x42C90738UL))
#define bFM3_ETHERNET_MAC0_MAR23H_A47          *((volatile unsigned int*)(0x42C9073CUL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC0         *((volatile unsigned int*)(0x42C90760UL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC1         *((volatile unsigned int*)(0x42C90764UL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC2         *((volatile unsigned int*)(0x42C90768UL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC3         *((volatile unsigned int*)(0x42C9076CUL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC4         *((volatile unsigned int*)(0x42C90770UL))
#define bFM3_ETHERNET_MAC0_MAR23H_MBC5         *((volatile unsigned int*)(0x42C90774UL))
#define bFM3_ETHERNET_MAC0_MAR23H_SA           *((volatile unsigned int*)(0x42C90778UL))
#define bFM3_ETHERNET_MAC0_MAR23H_AE           *((volatile unsigned int*)(0x42C9077CUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A0           *((volatile unsigned int*)(0x42C90780UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A1           *((volatile unsigned int*)(0x42C90784UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A2           *((volatile unsigned int*)(0x42C90788UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A3           *((volatile unsigned int*)(0x42C9078CUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A4           *((volatile unsigned int*)(0x42C90790UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A5           *((volatile unsigned int*)(0x42C90794UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A6           *((volatile unsigned int*)(0x42C90798UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A7           *((volatile unsigned int*)(0x42C9079CUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A8           *((volatile unsigned int*)(0x42C907A0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A9           *((volatile unsigned int*)(0x42C907A4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A10          *((volatile unsigned int*)(0x42C907A8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A11          *((volatile unsigned int*)(0x42C907ACUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A12          *((volatile unsigned int*)(0x42C907B0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A13          *((volatile unsigned int*)(0x42C907B4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A14          *((volatile unsigned int*)(0x42C907B8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A15          *((volatile unsigned int*)(0x42C907BCUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A16          *((volatile unsigned int*)(0x42C907C0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A17          *((volatile unsigned int*)(0x42C907C4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A18          *((volatile unsigned int*)(0x42C907C8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A19          *((volatile unsigned int*)(0x42C907CCUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A20          *((volatile unsigned int*)(0x42C907D0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A21          *((volatile unsigned int*)(0x42C907D4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A22          *((volatile unsigned int*)(0x42C907D8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A23          *((volatile unsigned int*)(0x42C907DCUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A24          *((volatile unsigned int*)(0x42C907E0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A25          *((volatile unsigned int*)(0x42C907E4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A26          *((volatile unsigned int*)(0x42C907E8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A27          *((volatile unsigned int*)(0x42C907ECUL))
#define bFM3_ETHERNET_MAC0_MAR23L_A28          *((volatile unsigned int*)(0x42C907F0UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A29          *((volatile unsigned int*)(0x42C907F4UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A30          *((volatile unsigned int*)(0x42C907F8UL))
#define bFM3_ETHERNET_MAC0_MAR23L_A31          *((volatile unsigned int*)(0x42C907FCUL))
#define bFM3_ETHERNET_MAC0_MAR24H_A32          *((volatile unsigned int*)(0x42C90800UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A33          *((volatile unsigned int*)(0x42C90804UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A34          *((volatile unsigned int*)(0x42C90808UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A35          *((volatile unsigned int*)(0x42C9080CUL))
#define bFM3_ETHERNET_MAC0_MAR24H_A36          *((volatile unsigned int*)(0x42C90810UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A37          *((volatile unsigned int*)(0x42C90814UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A38          *((volatile unsigned int*)(0x42C90818UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A39          *((volatile unsigned int*)(0x42C9081CUL))
#define bFM3_ETHERNET_MAC0_MAR24H_A40          *((volatile unsigned int*)(0x42C90820UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A41          *((volatile unsigned int*)(0x42C90824UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A42          *((volatile unsigned int*)(0x42C90828UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A43          *((volatile unsigned int*)(0x42C9082CUL))
#define bFM3_ETHERNET_MAC0_MAR24H_A44          *((volatile unsigned int*)(0x42C90830UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A45          *((volatile unsigned int*)(0x42C90834UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A46          *((volatile unsigned int*)(0x42C90838UL))
#define bFM3_ETHERNET_MAC0_MAR24H_A47          *((volatile unsigned int*)(0x42C9083CUL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC0         *((volatile unsigned int*)(0x42C90860UL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC1         *((volatile unsigned int*)(0x42C90864UL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC2         *((volatile unsigned int*)(0x42C90868UL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC3         *((volatile unsigned int*)(0x42C9086CUL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC4         *((volatile unsigned int*)(0x42C90870UL))
#define bFM3_ETHERNET_MAC0_MAR24H_MBC5         *((volatile unsigned int*)(0x42C90874UL))
#define bFM3_ETHERNET_MAC0_MAR24H_SA           *((volatile unsigned int*)(0x42C90878UL))
#define bFM3_ETHERNET_MAC0_MAR24H_AE           *((volatile unsigned int*)(0x42C9087CUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A0           *((volatile unsigned int*)(0x42C90880UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A1           *((volatile unsigned int*)(0x42C90884UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A2           *((volatile unsigned int*)(0x42C90888UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A3           *((volatile unsigned int*)(0x42C9088CUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A4           *((volatile unsigned int*)(0x42C90890UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A5           *((volatile unsigned int*)(0x42C90894UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A6           *((volatile unsigned int*)(0x42C90898UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A7           *((volatile unsigned int*)(0x42C9089CUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A8           *((volatile unsigned int*)(0x42C908A0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A9           *((volatile unsigned int*)(0x42C908A4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A10          *((volatile unsigned int*)(0x42C908A8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A11          *((volatile unsigned int*)(0x42C908ACUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A12          *((volatile unsigned int*)(0x42C908B0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A13          *((volatile unsigned int*)(0x42C908B4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A14          *((volatile unsigned int*)(0x42C908B8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A15          *((volatile unsigned int*)(0x42C908BCUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A16          *((volatile unsigned int*)(0x42C908C0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A17          *((volatile unsigned int*)(0x42C908C4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A18          *((volatile unsigned int*)(0x42C908C8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A19          *((volatile unsigned int*)(0x42C908CCUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A20          *((volatile unsigned int*)(0x42C908D0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A21          *((volatile unsigned int*)(0x42C908D4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A22          *((volatile unsigned int*)(0x42C908D8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A23          *((volatile unsigned int*)(0x42C908DCUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A24          *((volatile unsigned int*)(0x42C908E0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A25          *((volatile unsigned int*)(0x42C908E4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A26          *((volatile unsigned int*)(0x42C908E8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A27          *((volatile unsigned int*)(0x42C908ECUL))
#define bFM3_ETHERNET_MAC0_MAR24L_A28          *((volatile unsigned int*)(0x42C908F0UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A29          *((volatile unsigned int*)(0x42C908F4UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A30          *((volatile unsigned int*)(0x42C908F8UL))
#define bFM3_ETHERNET_MAC0_MAR24L_A31          *((volatile unsigned int*)(0x42C908FCUL))
#define bFM3_ETHERNET_MAC0_MAR25H_A32          *((volatile unsigned int*)(0x42C90900UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A33          *((volatile unsigned int*)(0x42C90904UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A34          *((volatile unsigned int*)(0x42C90908UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A35          *((volatile unsigned int*)(0x42C9090CUL))
#define bFM3_ETHERNET_MAC0_MAR25H_A36          *((volatile unsigned int*)(0x42C90910UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A37          *((volatile unsigned int*)(0x42C90914UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A38          *((volatile unsigned int*)(0x42C90918UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A39          *((volatile unsigned int*)(0x42C9091CUL))
#define bFM3_ETHERNET_MAC0_MAR25H_A40          *((volatile unsigned int*)(0x42C90920UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A41          *((volatile unsigned int*)(0x42C90924UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A42          *((volatile unsigned int*)(0x42C90928UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A43          *((volatile unsigned int*)(0x42C9092CUL))
#define bFM3_ETHERNET_MAC0_MAR25H_A44          *((volatile unsigned int*)(0x42C90930UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A45          *((volatile unsigned int*)(0x42C90934UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A46          *((volatile unsigned int*)(0x42C90938UL))
#define bFM3_ETHERNET_MAC0_MAR25H_A47          *((volatile unsigned int*)(0x42C9093CUL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC0         *((volatile unsigned int*)(0x42C90960UL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC1         *((volatile unsigned int*)(0x42C90964UL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC2         *((volatile unsigned int*)(0x42C90968UL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC3         *((volatile unsigned int*)(0x42C9096CUL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC4         *((volatile unsigned int*)(0x42C90970UL))
#define bFM3_ETHERNET_MAC0_MAR25H_MBC5         *((volatile unsigned int*)(0x42C90974UL))
#define bFM3_ETHERNET_MAC0_MAR25H_SA           *((volatile unsigned int*)(0x42C90978UL))
#define bFM3_ETHERNET_MAC0_MAR25H_AE           *((volatile unsigned int*)(0x42C9097CUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A0           *((volatile unsigned int*)(0x42C90980UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A1           *((volatile unsigned int*)(0x42C90984UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A2           *((volatile unsigned int*)(0x42C90988UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A3           *((volatile unsigned int*)(0x42C9098CUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A4           *((volatile unsigned int*)(0x42C90990UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A5           *((volatile unsigned int*)(0x42C90994UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A6           *((volatile unsigned int*)(0x42C90998UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A7           *((volatile unsigned int*)(0x42C9099CUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A8           *((volatile unsigned int*)(0x42C909A0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A9           *((volatile unsigned int*)(0x42C909A4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A10          *((volatile unsigned int*)(0x42C909A8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A11          *((volatile unsigned int*)(0x42C909ACUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A12          *((volatile unsigned int*)(0x42C909B0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A13          *((volatile unsigned int*)(0x42C909B4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A14          *((volatile unsigned int*)(0x42C909B8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A15          *((volatile unsigned int*)(0x42C909BCUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A16          *((volatile unsigned int*)(0x42C909C0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A17          *((volatile unsigned int*)(0x42C909C4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A18          *((volatile unsigned int*)(0x42C909C8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A19          *((volatile unsigned int*)(0x42C909CCUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A20          *((volatile unsigned int*)(0x42C909D0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A21          *((volatile unsigned int*)(0x42C909D4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A22          *((volatile unsigned int*)(0x42C909D8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A23          *((volatile unsigned int*)(0x42C909DCUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A24          *((volatile unsigned int*)(0x42C909E0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A25          *((volatile unsigned int*)(0x42C909E4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A26          *((volatile unsigned int*)(0x42C909E8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A27          *((volatile unsigned int*)(0x42C909ECUL))
#define bFM3_ETHERNET_MAC0_MAR25L_A28          *((volatile unsigned int*)(0x42C909F0UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A29          *((volatile unsigned int*)(0x42C909F4UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A30          *((volatile unsigned int*)(0x42C909F8UL))
#define bFM3_ETHERNET_MAC0_MAR25L_A31          *((volatile unsigned int*)(0x42C909FCUL))
#define bFM3_ETHERNET_MAC0_MAR26H_A32          *((volatile unsigned int*)(0x42C90A00UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A33          *((volatile unsigned int*)(0x42C90A04UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A34          *((volatile unsigned int*)(0x42C90A08UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A35          *((volatile unsigned int*)(0x42C90A0CUL))
#define bFM3_ETHERNET_MAC0_MAR26H_A36          *((volatile unsigned int*)(0x42C90A10UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A37          *((volatile unsigned int*)(0x42C90A14UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A38          *((volatile unsigned int*)(0x42C90A18UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A39          *((volatile unsigned int*)(0x42C90A1CUL))
#define bFM3_ETHERNET_MAC0_MAR26H_A40          *((volatile unsigned int*)(0x42C90A20UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A41          *((volatile unsigned int*)(0x42C90A24UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A42          *((volatile unsigned int*)(0x42C90A28UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A43          *((volatile unsigned int*)(0x42C90A2CUL))
#define bFM3_ETHERNET_MAC0_MAR26H_A44          *((volatile unsigned int*)(0x42C90A30UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A45          *((volatile unsigned int*)(0x42C90A34UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A46          *((volatile unsigned int*)(0x42C90A38UL))
#define bFM3_ETHERNET_MAC0_MAR26H_A47          *((volatile unsigned int*)(0x42C90A3CUL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC0         *((volatile unsigned int*)(0x42C90A60UL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC1         *((volatile unsigned int*)(0x42C90A64UL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC2         *((volatile unsigned int*)(0x42C90A68UL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC3         *((volatile unsigned int*)(0x42C90A6CUL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC4         *((volatile unsigned int*)(0x42C90A70UL))
#define bFM3_ETHERNET_MAC0_MAR26H_MBC5         *((volatile unsigned int*)(0x42C90A74UL))
#define bFM3_ETHERNET_MAC0_MAR26H_SA           *((volatile unsigned int*)(0x42C90A78UL))
#define bFM3_ETHERNET_MAC0_MAR26H_AE           *((volatile unsigned int*)(0x42C90A7CUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A0           *((volatile unsigned int*)(0x42C90A80UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A1           *((volatile unsigned int*)(0x42C90A84UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A2           *((volatile unsigned int*)(0x42C90A88UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A3           *((volatile unsigned int*)(0x42C90A8CUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A4           *((volatile unsigned int*)(0x42C90A90UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A5           *((volatile unsigned int*)(0x42C90A94UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A6           *((volatile unsigned int*)(0x42C90A98UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A7           *((volatile unsigned int*)(0x42C90A9CUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A8           *((volatile unsigned int*)(0x42C90AA0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A9           *((volatile unsigned int*)(0x42C90AA4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A10          *((volatile unsigned int*)(0x42C90AA8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A11          *((volatile unsigned int*)(0x42C90AACUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A12          *((volatile unsigned int*)(0x42C90AB0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A13          *((volatile unsigned int*)(0x42C90AB4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A14          *((volatile unsigned int*)(0x42C90AB8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A15          *((volatile unsigned int*)(0x42C90ABCUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A16          *((volatile unsigned int*)(0x42C90AC0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A17          *((volatile unsigned int*)(0x42C90AC4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A18          *((volatile unsigned int*)(0x42C90AC8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A19          *((volatile unsigned int*)(0x42C90ACCUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A20          *((volatile unsigned int*)(0x42C90AD0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A21          *((volatile unsigned int*)(0x42C90AD4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A22          *((volatile unsigned int*)(0x42C90AD8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A23          *((volatile unsigned int*)(0x42C90ADCUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A24          *((volatile unsigned int*)(0x42C90AE0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A25          *((volatile unsigned int*)(0x42C90AE4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A26          *((volatile unsigned int*)(0x42C90AE8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A27          *((volatile unsigned int*)(0x42C90AECUL))
#define bFM3_ETHERNET_MAC0_MAR26L_A28          *((volatile unsigned int*)(0x42C90AF0UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A29          *((volatile unsigned int*)(0x42C90AF4UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A30          *((volatile unsigned int*)(0x42C90AF8UL))
#define bFM3_ETHERNET_MAC0_MAR26L_A31          *((volatile unsigned int*)(0x42C90AFCUL))
#define bFM3_ETHERNET_MAC0_MAR27H_A32          *((volatile unsigned int*)(0x42C90B00UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A33          *((volatile unsigned int*)(0x42C90B04UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A34          *((volatile unsigned int*)(0x42C90B08UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A35          *((volatile unsigned int*)(0x42C90B0CUL))
#define bFM3_ETHERNET_MAC0_MAR27H_A36          *((volatile unsigned int*)(0x42C90B10UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A37          *((volatile unsigned int*)(0x42C90B14UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A38          *((volatile unsigned int*)(0x42C90B18UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A39          *((volatile unsigned int*)(0x42C90B1CUL))
#define bFM3_ETHERNET_MAC0_MAR27H_A40          *((volatile unsigned int*)(0x42C90B20UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A41          *((volatile unsigned int*)(0x42C90B24UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A42          *((volatile unsigned int*)(0x42C90B28UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A43          *((volatile unsigned int*)(0x42C90B2CUL))
#define bFM3_ETHERNET_MAC0_MAR27H_A44          *((volatile unsigned int*)(0x42C90B30UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A45          *((volatile unsigned int*)(0x42C90B34UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A46          *((volatile unsigned int*)(0x42C90B38UL))
#define bFM3_ETHERNET_MAC0_MAR27H_A47          *((volatile unsigned int*)(0x42C90B3CUL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC0         *((volatile unsigned int*)(0x42C90B60UL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC1         *((volatile unsigned int*)(0x42C90B64UL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC2         *((volatile unsigned int*)(0x42C90B68UL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC3         *((volatile unsigned int*)(0x42C90B6CUL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC4         *((volatile unsigned int*)(0x42C90B70UL))
#define bFM3_ETHERNET_MAC0_MAR27H_MBC5         *((volatile unsigned int*)(0x42C90B74UL))
#define bFM3_ETHERNET_MAC0_MAR27H_SA           *((volatile unsigned int*)(0x42C90B78UL))
#define bFM3_ETHERNET_MAC0_MAR27H_AE           *((volatile unsigned int*)(0x42C90B7CUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A0           *((volatile unsigned int*)(0x42C90B80UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A1           *((volatile unsigned int*)(0x42C90B84UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A2           *((volatile unsigned int*)(0x42C90B88UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A3           *((volatile unsigned int*)(0x42C90B8CUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A4           *((volatile unsigned int*)(0x42C90B90UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A5           *((volatile unsigned int*)(0x42C90B94UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A6           *((volatile unsigned int*)(0x42C90B98UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A7           *((volatile unsigned int*)(0x42C90B9CUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A8           *((volatile unsigned int*)(0x42C90BA0UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A9           *((volatile unsigned int*)(0x42C90BA4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A10          *((volatile unsigned int*)(0x42C90BA8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A11          *((volatile unsigned int*)(0x42C90BACUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A12          *((volatile unsigned int*)(0x42C90BB0UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A13          *((volatile unsigned int*)(0x42C90BB4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A14          *((volatile unsigned int*)(0x42C90BB8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A15          *((volatile unsigned int*)(0x42C90BBCUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A16          *((volatile unsigned int*)(0x42C90BC0UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A17          *((volatile unsigned int*)(0x42C90BC4UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A18          *((volatile unsigned int*)(0x42C90BC8UL))
#define bFM3_ETHERNET_MAC0_MAR27L_A19          *((volatile unsigned int*)(0x42C90BCCUL))
#define bFM3_ETHERNET_MAC0_MAR27L_A20          *((volatile unsigned int*)(0x42C90BD0UL))
