RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC1_TTSR_TSTR8          *((volatile unsigned int*)(0x42CEE3A0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR9          *((volatile unsigned int*)(0x42CEE3A4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR10         *((volatile unsigned int*)(0x42CEE3A8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR11         *((volatile unsigned int*)(0x42CEE3ACUL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR12         *((volatile unsigned int*)(0x42CEE3B0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR13         *((volatile unsigned int*)(0x42CEE3B4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR14         *((volatile unsigned int*)(0x42CEE3B8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR15         *((volatile unsigned int*)(0x42CEE3BCUL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR16         *((volatile unsigned int*)(0x42CEE3C0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR17         *((volatile unsigned int*)(0x42CEE3C4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR18         *((volatile unsigned int*)(0x42CEE3C8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR19         *((volatile unsigned int*)(0x42CEE3CCUL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR20         *((volatile unsigned int*)(0x42CEE3D0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR21         *((volatile unsigned int*)(0x42CEE3D4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR22         *((volatile unsigned int*)(0x42CEE3D8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR23         *((volatile unsigned int*)(0x42CEE3DCUL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR24         *((volatile unsigned int*)(0x42CEE3E0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR25         *((volatile unsigned int*)(0x42CEE3E4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR26         *((volatile unsigned int*)(0x42CEE3E8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR27         *((volatile unsigned int*)(0x42CEE3ECUL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR28         *((volatile unsigned int*)(0x42CEE3F0UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR29         *((volatile unsigned int*)(0x42CEE3F4UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR30         *((volatile unsigned int*)(0x42CEE3F8UL))
#define bFM3_ETHERNET_MAC1_TTSR_TSTR31         *((volatile unsigned int*)(0x42CEE3FCUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR0          *((volatile unsigned int*)(0x42CEE400UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR1          *((volatile unsigned int*)(0x42CEE404UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR2          *((volatile unsigned int*)(0x42CEE408UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR3          *((volatile unsigned int*)(0x42CEE40CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR4          *((volatile unsigned int*)(0x42CEE410UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR5          *((volatile unsigned int*)(0x42CEE414UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR6          *((volatile unsigned int*)(0x42CEE418UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR7          *((volatile unsigned int*)(0x42CEE41CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR8          *((volatile unsigned int*)(0x42CEE420UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR9          *((volatile unsigned int*)(0x42CEE424UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR10         *((volatile unsigned int*)(0x42CEE428UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR11         *((volatile unsigned int*)(0x42CEE42CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR12         *((volatile unsigned int*)(0x42CEE430UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR13         *((volatile unsigned int*)(0x42CEE434UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR14         *((volatile unsigned int*)(0x42CEE438UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR15         *((volatile unsigned int*)(0x42CEE43CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR16         *((volatile unsigned int*)(0x42CEE440UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR17         *((volatile unsigned int*)(0x42CEE444UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR18         *((volatile unsigned int*)(0x42CEE448UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR19         *((volatile unsigned int*)(0x42CEE44CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR20         *((volatile unsigned int*)(0x42CEE450UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR21         *((volatile unsigned int*)(0x42CEE454UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR22         *((volatile unsigned int*)(0x42CEE458UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR23         *((volatile unsigned int*)(0x42CEE45CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR24         *((volatile unsigned int*)(0x42CEE460UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR25         *((volatile unsigned int*)(0x42CEE464UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR26         *((volatile unsigned int*)(0x42CEE468UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR27         *((volatile unsigned int*)(0x42CEE46CUL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR28         *((volatile unsigned int*)(0x42CEE470UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR29         *((volatile unsigned int*)(0x42CEE474UL))
#define bFM3_ETHERNET_MAC1_TTNR_TSTR30         *((volatile unsigned int*)(0x42CEE478UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR0       *((volatile unsigned int*)(0x42CEE480UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR1       *((volatile unsigned int*)(0x42CEE484UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR2       *((volatile unsigned int*)(0x42CEE488UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR3       *((volatile unsigned int*)(0x42CEE48CUL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR4       *((volatile unsigned int*)(0x42CEE490UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR5       *((volatile unsigned int*)(0x42CEE494UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR6       *((volatile unsigned int*)(0x42CEE498UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR7       *((volatile unsigned int*)(0x42CEE49CUL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR8       *((volatile unsigned int*)(0x42CEE4A0UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR9       *((volatile unsigned int*)(0x42CEE4A4UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR10      *((volatile unsigned int*)(0x42CEE4A8UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR11      *((volatile unsigned int*)(0x42CEE4ACUL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR12      *((volatile unsigned int*)(0x42CEE4B0UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR13      *((volatile unsigned int*)(0x42CEE4B4UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR14      *((volatile unsigned int*)(0x42CEE4B8UL))
#define bFM3_ETHERNET_MAC1_STHWSR_TSHWR15      *((volatile unsigned int*)(0x42CEE4BCUL))
#define bFM3_ETHERNET_MAC1_TSR_TSSOVF          *((volatile unsigned int*)(0x42CEE500UL))
#define bFM3_ETHERNET_MAC1_TSR_TSTART          *((volatile unsigned int*)(0x42CEE504UL))
#define bFM3_ETHERNET_MAC1_TSR_ATSTS           *((volatile unsigned int*)(0x42CEE508UL))
#define bFM3_ETHERNET_MAC1_TSR_TRGTER          *((volatile unsigned int*)(0x42C8E50CUL))
#define bFM3_ETHERNET_MAC1_TSR_ATSSTM          *((volatile unsigned int*)(0x42CEE560UL))
#define bFM3_ETHERNET_MAC1_TSR_ATSNS0          *((volatile unsigned int*)(0x42CEE564UL))
#define bFM3_ETHERNET_MAC1_TSR_ATSNS1          *((volatile unsigned int*)(0x42CEE568UL))
#define bFM3_ETHERNET_MAC1_TSR_ATSNS2          *((volatile unsigned int*)(0x42CEE56CUL))
#define bFM3_ETHERNET_MAC1_PPSCR_PPSCTRL0      *((volatile unsigned int*)(0x42CEE580UL))
#define bFM3_ETHERNET_MAC1_PPSCR_PPSCTRL1      *((volatile unsigned int*)(0x42CEE584UL))
#define bFM3_ETHERNET_MAC1_PPSCR_PPSCTRL2      *((volatile unsigned int*)(0x42CEE588UL))
#define bFM3_ETHERNET_MAC1_PPSCR_PPSCTRL3      *((volatile unsigned int*)(0x42CEE58CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN0           *((volatile unsigned int*)(0x42CEE600UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN1           *((volatile unsigned int*)(0x42CEE604UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN2           *((volatile unsigned int*)(0x42CEE608UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN3           *((volatile unsigned int*)(0x42CEE60CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN4           *((volatile unsigned int*)(0x42CEE610UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN5           *((volatile unsigned int*)(0x42CEE614UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN6           *((volatile unsigned int*)(0x42CEE618UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN7           *((volatile unsigned int*)(0x42CEE61CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN8           *((volatile unsigned int*)(0x42CEE620UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN9           *((volatile unsigned int*)(0x42CEE624UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN10          *((volatile unsigned int*)(0x42CEE628UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN11          *((volatile unsigned int*)(0x42CEE62CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN12          *((volatile unsigned int*)(0x42CEE630UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN13          *((volatile unsigned int*)(0x42CEE634UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN14          *((volatile unsigned int*)(0x42CEE638UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN15          *((volatile unsigned int*)(0x42CEE63CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN16          *((volatile unsigned int*)(0x42CEE640UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN17          *((volatile unsigned int*)(0x42CEE644UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN18          *((volatile unsigned int*)(0x42CEE648UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN19          *((volatile unsigned int*)(0x42CEE64CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN20          *((volatile unsigned int*)(0x42CEE650UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN21          *((volatile unsigned int*)(0x42CEE654UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN22          *((volatile unsigned int*)(0x42CEE658UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN23          *((volatile unsigned int*)(0x42CEE65CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN24          *((volatile unsigned int*)(0x42CEE660UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN25          *((volatile unsigned int*)(0x42CEE664UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN26          *((volatile unsigned int*)(0x42CEE668UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN27          *((volatile unsigned int*)(0x42CEE66CUL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN28          *((volatile unsigned int*)(0x42CEE670UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN29          *((volatile unsigned int*)(0x42CEE674UL))
#define bFM3_ETHERNET_MAC1_ATNR_ATN30          *((volatile unsigned int*)(0x42CEE678UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS0           *((volatile unsigned int*)(0x42CEE680UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS1           *((volatile unsigned int*)(0x42CEE684UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS2           *((volatile unsigned int*)(0x42CEE688UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS3           *((volatile unsigned int*)(0x42CEE68CUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS4           *((volatile unsigned int*)(0x42CEE690UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS5           *((volatile unsigned int*)(0x42CEE694UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS6           *((volatile unsigned int*)(0x42CEE698UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS7           *((volatile unsigned int*)(0x42CEE69CUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS8           *((volatile unsigned int*)(0x42CEE6A0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS9           *((volatile unsigned int*)(0x42CEE6A4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS10          *((volatile unsigned int*)(0x42CEE6A8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS11          *((volatile unsigned int*)(0x42CEE6ACUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS12          *((volatile unsigned int*)(0x42CEE6B0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS13          *((volatile unsigned int*)(0x42CEE6B4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS14          *((volatile unsigned int*)(0x42CEE6B8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS15          *((volatile unsigned int*)(0x42CEE6BCUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS16          *((volatile unsigned int*)(0x42CEE6C0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS17          *((volatile unsigned int*)(0x42CEE6C4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS18          *((volatile unsigned int*)(0x42CEE6C8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS19          *((volatile unsigned int*)(0x42CEE6CCUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS20          *((volatile unsigned int*)(0x42CEE6D0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS21          *((volatile unsigned int*)(0x42CEE6D4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS22          *((volatile unsigned int*)(0x42CEE6D8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS23          *((volatile unsigned int*)(0x42CEE6DCUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS24          *((volatile unsigned int*)(0x42CEE6E0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS25          *((volatile unsigned int*)(0x42CEE6E4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS26          *((volatile unsigned int*)(0x42CEE6E8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS27          *((volatile unsigned int*)(0x42CEE6ECUL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS28          *((volatile unsigned int*)(0x42CEE6F0UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS29          *((volatile unsigned int*)(0x42CEE6F4UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS30          *((volatile unsigned int*)(0x42CEE6F8UL))
#define bFM3_ETHERNET_MAC1_ATSR_ATS31          *((volatile unsigned int*)(0x42CEE6FCUL))
#define bFM3_ETHERNET_MAC1_MAR16H_A32          *((volatile unsigned int*)(0x42CF0000UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A33          *((volatile unsigned int*)(0x42CF0004UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A34          *((volatile unsigned int*)(0x42CF0008UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A35          *((volatile unsigned int*)(0x42CF000CUL))
#define bFM3_ETHERNET_MAC1_MAR16H_A36          *((volatile unsigned int*)(0x42CF0010UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A37          *((volatile unsigned int*)(0x42CF0014UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A38          *((volatile unsigned int*)(0x42CF0018UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A39          *((volatile unsigned int*)(0x42CF001CUL))
#define bFM3_ETHERNET_MAC1_MAR16H_A40          *((volatile unsigned int*)(0x42CF0020UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A41          *((volatile unsigned int*)(0x42CF0024UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A42          *((volatile unsigned int*)(0x42CF0028UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A43          *((volatile unsigned int*)(0x42CF002CUL))
#define bFM3_ETHERNET_MAC1_MAR16H_A44          *((volatile unsigned int*)(0x42CF0030UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A45          *((volatile unsigned int*)(0x42CF0034UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A46          *((volatile unsigned int*)(0x42CF0038UL))
#define bFM3_ETHERNET_MAC1_MAR16H_A47          *((volatile unsigned int*)(0x42CF003CUL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC0         *((volatile unsigned int*)(0x42CF0060UL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC1         *((volatile unsigned int*)(0x42CF0064UL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC2         *((volatile unsigned int*)(0x42CF0068UL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC3         *((volatile unsigned int*)(0x42CF006CUL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC4         *((volatile unsigned int*)(0x42CF0070UL))
#define bFM3_ETHERNET_MAC1_MAR16H_MBC5         *((volatile unsigned int*)(0x42CF0074UL))
#define bFM3_ETHERNET_MAC1_MAR16H_SA           *((volatile unsigned int*)(0x42CF0078UL))
#define bFM3_ETHERNET_MAC1_MAR16H_AE           *((volatile unsigned int*)(0x42CF007CUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A0           *((volatile unsigned int*)(0x42CF0080UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A1           *((volatile unsigned int*)(0x42CF0084UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A2           *((volatile unsigned int*)(0x42CF0088UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A3           *((volatile unsigned int*)(0x42CF008CUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A4           *((volatile unsigned int*)(0x42CF0090UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A5           *((volatile unsigned int*)(0x42CF0094UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A6           *((volatile unsigned int*)(0x42CF0098UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A7           *((volatile unsigned int*)(0x42CF009CUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A8           *((volatile unsigned int*)(0x42CF00A0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A9           *((volatile unsigned int*)(0x42CF00A4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A10          *((volatile unsigned int*)(0x42CF00A8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A11          *((volatile unsigned int*)(0x42CF00ACUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A12          *((volatile unsigned int*)(0x42CF00B0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A13          *((volatile unsigned int*)(0x42CF00B4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A14          *((volatile unsigned int*)(0x42CF00B8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A15          *((volatile unsigned int*)(0x42CF00BCUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A16          *((volatile unsigned int*)(0x42CF00C0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A17          *((volatile unsigned int*)(0x42CF00C4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A18          *((volatile unsigned int*)(0x42CF00C8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A19          *((volatile unsigned int*)(0x42CF00CCUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A20          *((volatile unsigned int*)(0x42CF00D0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A21          *((volatile unsigned int*)(0x42CF00D4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A22          *((volatile unsigned int*)(0x42CF00D8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A23          *((volatile unsigned int*)(0x42CF00DCUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A24          *((volatile unsigned int*)(0x42CF00E0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A25          *((volatile unsigned int*)(0x42CF00E4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A26          *((volatile unsigned int*)(0x42CF00E8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A27          *((volatile unsigned int*)(0x42CF00ECUL))
#define bFM3_ETHERNET_MAC1_MAR16L_A28          *((volatile unsigned int*)(0x42CF00F0UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A29          *((volatile unsigned int*)(0x42CF00F4UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A30          *((volatile unsigned int*)(0x42CF00F8UL))
#define bFM3_ETHERNET_MAC1_MAR16L_A31          *((volatile unsigned int*)(0x42CF00FCUL))
#define bFM3_ETHERNET_MAC1_MAR17H_A32          *((volatile unsigned int*)(0x42CF0100UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A33          *((volatile unsigned int*)(0x42CF0104UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A34          *((volatile unsigned int*)(0x42CF0108UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A35          *((volatile unsigned int*)(0x42CF010CUL))
#define bFM3_ETHERNET_MAC1_MAR17H_A36          *((volatile unsigned int*)(0x42CF0110UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A37          *((volatile unsigned int*)(0x42CF0114UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A38          *((volatile unsigned int*)(0x42CF0118UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A39          *((volatile unsigned int*)(0x42CF011CUL))
#define bFM3_ETHERNET_MAC1_MAR17H_A40          *((volatile unsigned int*)(0x42CF0120UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A41          *((volatile unsigned int*)(0x42CF0124UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A42          *((volatile unsigned int*)(0x42CF0128UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A43          *((volatile unsigned int*)(0x42CF012CUL))
#define bFM3_ETHERNET_MAC1_MAR17H_A44          *((volatile unsigned int*)(0x42CF0130UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A45          *((volatile unsigned int*)(0x42CF0134UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A46          *((volatile unsigned int*)(0x42CF0138UL))
#define bFM3_ETHERNET_MAC1_MAR17H_A47          *((volatile unsigned int*)(0x42CF013CUL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC0         *((volatile unsigned int*)(0x42CF0160UL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC1         *((volatile unsigned int*)(0x42CF0164UL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC2         *((volatile unsigned int*)(0x42CF0168UL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC3         *((volatile unsigned int*)(0x42CF016CUL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC4         *((volatile unsigned int*)(0x42CF0170UL))
#define bFM3_ETHERNET_MAC1_MAR17H_MBC5         *((volatile unsigned int*)(0x42CF0174UL))
#define bFM3_ETHERNET_MAC1_MAR17H_SA           *((volatile unsigned int*)(0x42CF0178UL))
#define bFM3_ETHERNET_MAC1_MAR17H_AE           *((volatile unsigned int*)(0x42CF017CUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A0           *((volatile unsigned int*)(0x42CF0180UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A1           *((volatile unsigned int*)(0x42CF0184UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A2           *((volatile unsigned int*)(0x42CF0188UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A3           *((volatile unsigned int*)(0x42CF018CUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A4           *((volatile unsigned int*)(0x42CF0190UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A5           *((volatile unsigned int*)(0x42CF0194UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A6           *((volatile unsigned int*)(0x42CF0198UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A7           *((volatile unsigned int*)(0x42CF019CUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A8           *((volatile unsigned int*)(0x42CF01A0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A9           *((volatile unsigned int*)(0x42CF01A4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A10          *((volatile unsigned int*)(0x42CF01A8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A11          *((volatile unsigned int*)(0x42CF01ACUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A12          *((volatile unsigned int*)(0x42CF01B0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A13          *((volatile unsigned int*)(0x42CF01B4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A14          *((volatile unsigned int*)(0x42CF01B8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A15          *((volatile unsigned int*)(0x42CF01BCUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A16          *((volatile unsigned int*)(0x42CF01C0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A17          *((volatile unsigned int*)(0x42CF01C4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A18          *((volatile unsigned int*)(0x42CF01C8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A19          *((volatile unsigned int*)(0x42CF01CCUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A20          *((volatile unsigned int*)(0x42CF01D0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A21          *((volatile unsigned int*)(0x42CF01D4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A22          *((volatile unsigned int*)(0x42CF01D8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A23          *((volatile unsigned int*)(0x42CF01DCUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A24          *((volatile unsigned int*)(0x42CF01E0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A25          *((volatile unsigned int*)(0x42CF01E4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A26          *((volatile unsigned int*)(0x42CF01E8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A27          *((volatile unsigned int*)(0x42CF01ECUL))
#define bFM3_ETHERNET_MAC1_MAR17L_A28          *((volatile unsigned int*)(0x42CF01F0UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A29          *((volatile unsigned int*)(0x42CF01F4UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A30          *((volatile unsigned int*)(0x42CF01F8UL))
#define bFM3_ETHERNET_MAC1_MAR17L_A31          *((volatile unsigned int*)(0x42CF01FCUL))
#define bFM3_ETHERNET_MAC1_MAR18H_A32          *((volatile unsigned int*)(0x42CF0200UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A33          *((volatile unsigned int*)(0x42CF0204UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A34          *((volatile unsigned int*)(0x42CF0208UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A35          *((volatile unsigned int*)(0x42CF020CUL))
#define bFM3_ETHERNET_MAC1_MAR18H_A36          *((volatile unsigned int*)(0x42CF0210UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A37          *((volatile unsigned int*)(0x42CF0214UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A38          *((volatile unsigned int*)(0x42CF0218UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A39          *((volatile unsigned int*)(0x42CF021CUL))
#define bFM3_ETHERNET_MAC1_MAR18H_A40          *((volatile unsigned int*)(0x42CF0220UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A41          *((volatile unsigned int*)(0x42CF0224UL))
#define bFM3_ETHERNET_MAC1_MAR18H_A42          *((volatile unsigned int*)(0x42CF0228UL))
