RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC1_TPDR_TPD6           *((volatile unsigned int*)(0x42D00098UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD7           *((volatile unsigned int*)(0x42D0009CUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD8           *((volatile unsigned int*)(0x42D000A0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD9           *((volatile unsigned int*)(0x42D000A4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD10          *((volatile unsigned int*)(0x42D000A8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD11          *((volatile unsigned int*)(0x42D000ACUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD12          *((volatile unsigned int*)(0x42D000B0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD13          *((volatile unsigned int*)(0x42D000B4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD14          *((volatile unsigned int*)(0x42D000B8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD15          *((volatile unsigned int*)(0x42D000BCUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD16          *((volatile unsigned int*)(0x42D000C0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD17          *((volatile unsigned int*)(0x42D000C4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD18          *((volatile unsigned int*)(0x42D000C8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD19          *((volatile unsigned int*)(0x42D000CCUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD20          *((volatile unsigned int*)(0x42D000D0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD21          *((volatile unsigned int*)(0x42D000D4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD22          *((volatile unsigned int*)(0x42D000D8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD23          *((volatile unsigned int*)(0x42D000DCUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD24          *((volatile unsigned int*)(0x42D000E0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD25          *((volatile unsigned int*)(0x42D000E4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD26          *((volatile unsigned int*)(0x42D000E8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD27          *((volatile unsigned int*)(0x42D000ECUL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD28          *((volatile unsigned int*)(0x42D000F0UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD29          *((volatile unsigned int*)(0x42D000F4UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD30          *((volatile unsigned int*)(0x42D000F8UL))
#define bFM3_ETHERNET_MAC1_TPDR_TPD31          *((volatile unsigned int*)(0x42D000FCUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD0           *((volatile unsigned int*)(0x42D00100UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD1           *((volatile unsigned int*)(0x42D00104UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD2           *((volatile unsigned int*)(0x42D00108UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD3           *((volatile unsigned int*)(0x42D0010CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD4           *((volatile unsigned int*)(0x42D00110UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD5           *((volatile unsigned int*)(0x42D00114UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD6           *((volatile unsigned int*)(0x42D00118UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD7           *((volatile unsigned int*)(0x42D0011CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD8           *((volatile unsigned int*)(0x42D00120UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD9           *((volatile unsigned int*)(0x42D00124UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD10          *((volatile unsigned int*)(0x42D00128UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD11          *((volatile unsigned int*)(0x42D0012CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD12          *((volatile unsigned int*)(0x42D00130UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD13          *((volatile unsigned int*)(0x42D00134UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD14          *((volatile unsigned int*)(0x42D00138UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD15          *((volatile unsigned int*)(0x42D0013CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD16          *((volatile unsigned int*)(0x42D00140UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD17          *((volatile unsigned int*)(0x42D00144UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD18          *((volatile unsigned int*)(0x42D00148UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD19          *((volatile unsigned int*)(0x42D0014CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD20          *((volatile unsigned int*)(0x42D00150UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD21          *((volatile unsigned int*)(0x42D00154UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD22          *((volatile unsigned int*)(0x42D00158UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD23          *((volatile unsigned int*)(0x42D0015CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD24          *((volatile unsigned int*)(0x42D00160UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD25          *((volatile unsigned int*)(0x42D00164UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD26          *((volatile unsigned int*)(0x42D00168UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD27          *((volatile unsigned int*)(0x42D0016CUL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD28          *((volatile unsigned int*)(0x42D00170UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD29          *((volatile unsigned int*)(0x42D00174UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD30          *((volatile unsigned int*)(0x42D00178UL))
#define bFM3_ETHERNET_MAC1_RPDR_RPD31          *((volatile unsigned int*)(0x42D0017CUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL2          *((volatile unsigned int*)(0x42D00188UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL3          *((volatile unsigned int*)(0x42D0018CUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL4          *((volatile unsigned int*)(0x42D00190UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL5          *((volatile unsigned int*)(0x42D00194UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL6          *((volatile unsigned int*)(0x42D00198UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL7          *((volatile unsigned int*)(0x42D0019CUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL8          *((volatile unsigned int*)(0x42D001A0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL9          *((volatile unsigned int*)(0x42D001A4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL10         *((volatile unsigned int*)(0x42D001A8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL11         *((volatile unsigned int*)(0x42D001ACUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL12         *((volatile unsigned int*)(0x42D001B0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL13         *((volatile unsigned int*)(0x42D001B4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL14         *((volatile unsigned int*)(0x42D001B8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL15         *((volatile unsigned int*)(0x42D001BCUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL16         *((volatile unsigned int*)(0x42D001C0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL17         *((volatile unsigned int*)(0x42D001C4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL18         *((volatile unsigned int*)(0x42D001C8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL19         *((volatile unsigned int*)(0x42D001CCUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL20         *((volatile unsigned int*)(0x42D001D0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL21         *((volatile unsigned int*)(0x42D001D4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL22         *((volatile unsigned int*)(0x42D001D8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL23         *((volatile unsigned int*)(0x42D001DCUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL24         *((volatile unsigned int*)(0x42D001E0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL25         *((volatile unsigned int*)(0x42D001E4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL26         *((volatile unsigned int*)(0x42D001E8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL27         *((volatile unsigned int*)(0x42D001ECUL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL28         *((volatile unsigned int*)(0x42D001F0UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL29         *((volatile unsigned int*)(0x42D001F4UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL30         *((volatile unsigned int*)(0x42D001F8UL))
#define bFM3_ETHERNET_MAC1_RDLAR_SRL31         *((volatile unsigned int*)(0x42D001FCUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL2          *((volatile unsigned int*)(0x42D00208UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL3          *((volatile unsigned int*)(0x42D0020CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL4          *((volatile unsigned int*)(0x42D00210UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL5          *((volatile unsigned int*)(0x42D00214UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL6          *((volatile unsigned int*)(0x42D00218UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL7          *((volatile unsigned int*)(0x42D0021CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL8          *((volatile unsigned int*)(0x42D00220UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL9          *((volatile unsigned int*)(0x42D00224UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL10         *((volatile unsigned int*)(0x42D00228UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL11         *((volatile unsigned int*)(0x42D0022CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL12         *((volatile unsigned int*)(0x42D00230UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL13         *((volatile unsigned int*)(0x42D00234UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL14         *((volatile unsigned int*)(0x42D00238UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL15         *((volatile unsigned int*)(0x42D0023CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL16         *((volatile unsigned int*)(0x42D00240UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL17         *((volatile unsigned int*)(0x42D00244UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL18         *((volatile unsigned int*)(0x42D00248UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL19         *((volatile unsigned int*)(0x42D0024CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL20         *((volatile unsigned int*)(0x42D00250UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL21         *((volatile unsigned int*)(0x42D00254UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL22         *((volatile unsigned int*)(0x42D00258UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL23         *((volatile unsigned int*)(0x42D0025CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL24         *((volatile unsigned int*)(0x42D00260UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL25         *((volatile unsigned int*)(0x42D00264UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL26         *((volatile unsigned int*)(0x42D00268UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL27         *((volatile unsigned int*)(0x42D0026CUL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL28         *((volatile unsigned int*)(0x42D00270UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL29         *((volatile unsigned int*)(0x42D00274UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL30         *((volatile unsigned int*)(0x42D00278UL))
#define bFM3_ETHERNET_MAC1_TDLAR_STL31         *((volatile unsigned int*)(0x42D0027CUL))
#define bFM3_ETHERNET_MAC1_SR_TI               *((volatile unsigned int*)(0x42D00280UL))
#define bFM3_ETHERNET_MAC1_SR_TPS              *((volatile unsigned int*)(0x42D00284UL))
#define bFM3_ETHERNET_MAC1_SR_TU               *((volatile unsigned int*)(0x42D00288UL))
#define bFM3_ETHERNET_MAC1_SR_TJT              *((volatile unsigned int*)(0x42D0028CUL))
#define bFM3_ETHERNET_MAC1_SR_OVF              *((volatile unsigned int*)(0x42D00290UL))
#define bFM3_ETHERNET_MAC1_SR_UNF              *((volatile unsigned int*)(0x42D00294UL))
#define bFM3_ETHERNET_MAC1_SR_RI               *((volatile unsigned int*)(0x42D00298UL))
#define bFM3_ETHERNET_MAC1_SR_RU               *((volatile unsigned int*)(0x42D0029CUL))
#define bFM3_ETHERNET_MAC1_SR_RPS              *((volatile unsigned int*)(0x42D002A0UL))
#define bFM3_ETHERNET_MAC1_SR_RWT              *((volatile unsigned int*)(0x42D002A4UL))
#define bFM3_ETHERNET_MAC1_SR_ETI              *((volatile unsigned int*)(0x42D002A8UL))
#define bFM3_ETHERNET_MAC1_SR_FBI              *((volatile unsigned int*)(0x42D002B4UL))
#define bFM3_ETHERNET_MAC1_SR_ERI              *((volatile unsigned int*)(0x42D002B8UL))
#define bFM3_ETHERNET_MAC1_SR_AIS              *((volatile unsigned int*)(0x42D002BCUL))
#define bFM3_ETHERNET_MAC1_SR_NIS              *((volatile unsigned int*)(0x42D002C0UL))
#define bFM3_ETHERNET_MAC1_SR_RS0              *((volatile unsigned int*)(0x42D002C4UL))
#define bFM3_ETHERNET_MAC1_SR_RS1              *((volatile unsigned int*)(0x42D002C8UL))
#define bFM3_ETHERNET_MAC1_SR_RS2              *((volatile unsigned int*)(0x42D002CCUL))
#define bFM3_ETHERNET_MAC1_SR_TS0              *((volatile unsigned int*)(0x42D002D0UL))
#define bFM3_ETHERNET_MAC1_SR_TS1              *((volatile unsigned int*)(0x42D002D4UL))
#define bFM3_ETHERNET_MAC1_SR_TS2              *((volatile unsigned int*)(0x42D002D8UL))
#define bFM3_ETHERNET_MAC1_SR_EB0              *((volatile unsigned int*)(0x42D002DCUL))
#define bFM3_ETHERNET_MAC1_SR_EB1              *((volatile unsigned int*)(0x42D002E0UL))
#define bFM3_ETHERNET_MAC1_SR_EB2              *((volatile unsigned int*)(0x42D002E4UL))
#define bFM3_ETHERNET_MAC1_SR_GLI              *((volatile unsigned int*)(0x42D002E8UL))
#define bFM3_ETHERNET_MAC1_SR_GMI              *((volatile unsigned int*)(0x42D002ECUL))
#define bFM3_ETHERNET_MAC1_SR_GPI              *((volatile unsigned int*)(0x42D002F0UL))
#define bFM3_ETHERNET_MAC1_SR_TTI              *((volatile unsigned int*)(0x42D002F4UL))
#define bFM3_ETHERNET_MAC1_SR_GLPII            *((volatile unsigned int*)(0x42D002F8UL))
#define bFM3_ETHERNET_MAC1_OMR_SR              *((volatile unsigned int*)(0x42D00304UL))
#define bFM3_ETHERNET_MAC1_OMR_OSF             *((volatile unsigned int*)(0x42D00308UL))
#define bFM3_ETHERNET_MAC1_OMR_RTC0            *((volatile unsigned int*)(0x42D0030CUL))
#define bFM3_ETHERNET_MAC1_OMR_RTC1            *((volatile unsigned int*)(0x42D00310UL))
#define bFM3_ETHERNET_MAC1_OMR_FUF             *((volatile unsigned int*)(0x42D00318UL))
#define bFM3_ETHERNET_MAC1_OMR_FEF             *((volatile unsigned int*)(0x42D0031CUL))
#define bFM3_ETHERNET_MAC1_OMR_ST              *((volatile unsigned int*)(0x42D00334UL))
#define bFM3_ETHERNET_MAC1_OMR_TTC0            *((volatile unsigned int*)(0x42D00338UL))
#define bFM3_ETHERNET_MAC1_OMR_TTC1            *((volatile unsigned int*)(0x42D0033CUL))
#define bFM3_ETHERNET_MAC1_OMR_TTC2            *((volatile unsigned int*)(0x42D00340UL))
#define bFM3_ETHERNET_MAC1_OMR_FTF             *((volatile unsigned int*)(0x42D00350UL))
#define bFM3_ETHERNET_MAC1_OMR_TSF             *((volatile unsigned int*)(0x42D00354UL))
#define bFM3_ETHERNET_MAC1_OMR_DFF             *((volatile unsigned int*)(0x42D00360UL))
#define bFM3_ETHERNET_MAC1_OMR_RSF             *((volatile unsigned int*)(0x42D00364UL))
#define bFM3_ETHERNET_MAC1_OMR_DT              *((volatile unsigned int*)(0x42D00368UL))
#define bFM3_ETHERNET_MAC1_IER_TIE             *((volatile unsigned int*)(0x42D00380UL))
#define bFM3_ETHERNET_MAC1_IER_TSE             *((volatile unsigned int*)(0x42D00384UL))
#define bFM3_ETHERNET_MAC1_IER_TUE             *((volatile unsigned int*)(0x42D00388UL))
#define bFM3_ETHERNET_MAC1_IER_TJE             *((volatile unsigned int*)(0x42D0038CUL))
#define bFM3_ETHERNET_MAC1_IER_OVE             *((volatile unsigned int*)(0x42D00390UL))
#define bFM3_ETHERNET_MAC1_IER_UNE             *((volatile unsigned int*)(0x42D00394UL))
#define bFM3_ETHERNET_MAC1_IER_RIE             *((volatile unsigned int*)(0x42D00398UL))
#define bFM3_ETHERNET_MAC1_IER_RUE             *((volatile unsigned int*)(0x42D0039CUL))
#define bFM3_ETHERNET_MAC1_IER_RSE             *((volatile unsigned int*)(0x42D003A0UL))
#define bFM3_ETHERNET_MAC1_IER_RWE             *((volatile unsigned int*)(0x42D003A4UL))
#define bFM3_ETHERNET_MAC1_IER_ETE             *((volatile unsigned int*)(0x42D003A8UL))
#define bFM3_ETHERNET_MAC1_IER_FBE             *((volatile unsigned int*)(0x42D003B4UL))
#define bFM3_ETHERNET_MAC1_IER_ERE             *((volatile unsigned int*)(0x42D003B8UL))
#define bFM3_ETHERNET_MAC1_IER_AIE             *((volatile unsigned int*)(0x42D003BCUL))
#define bFM3_ETHERNET_MAC1_IER_NIE             *((volatile unsigned int*)(0x42D003C0UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH0        *((volatile unsigned int*)(0x42D00400UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH1        *((volatile unsigned int*)(0x42D00404UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH2        *((volatile unsigned int*)(0x42D00408UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH3        *((volatile unsigned int*)(0x42D0040CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH4        *((volatile unsigned int*)(0x42D00410UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH5        *((volatile unsigned int*)(0x42D00414UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH6        *((volatile unsigned int*)(0x42D00418UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH7        *((volatile unsigned int*)(0x42D0041CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH8        *((volatile unsigned int*)(0x42D00420UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH9        *((volatile unsigned int*)(0x42D00424UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH10       *((volatile unsigned int*)(0x42D00428UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH11       *((volatile unsigned int*)(0x42D0042CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH12       *((volatile unsigned int*)(0x42D00430UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH13       *((volatile unsigned int*)(0x42D00434UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH14       *((volatile unsigned int*)(0x42D00438UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFH15       *((volatile unsigned int*)(0x42D0043CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_ONMFH        *((volatile unsigned int*)(0x42D00440UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF0        *((volatile unsigned int*)(0x42D00444UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF1        *((volatile unsigned int*)(0x42D00448UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF2        *((volatile unsigned int*)(0x42D0044CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF3        *((volatile unsigned int*)(0x42D00450UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF4        *((volatile unsigned int*)(0x42D00454UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF5        *((volatile unsigned int*)(0x42D00458UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF6        *((volatile unsigned int*)(0x42D0045CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF7        *((volatile unsigned int*)(0x42D00460UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF8        *((volatile unsigned int*)(0x42D00464UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF9        *((volatile unsigned int*)(0x42D00468UL))
#define bFM3_ETHERNET_MAC1_MFBOCR_NMFF10       *((volatile unsigned int*)(0x42D0046CUL))
#define bFM3_ETHERNET_MAC1_MFBOCR_ONMFF        *((volatile unsigned int*)(0x42D00470UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT0         *((volatile unsigned int*)(0x42D00480UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT1         *((volatile unsigned int*)(0x42D00484UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT2         *((volatile unsigned int*)(0x42D00488UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT3         *((volatile unsigned int*)(0x42D0048CUL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT4         *((volatile unsigned int*)(0x42D00490UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT5         *((volatile unsigned int*)(0x42D00494UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT6         *((volatile unsigned int*)(0x42D00498UL))
#define bFM3_ETHERNET_MAC1_RIWTR_RIWT7         *((volatile unsigned int*)(0x42D0049CUL))
#define bFM3_ETHERNET_MAC1_AHBSR_AHBS          *((volatile unsigned int*)(0x42D00580UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP0        *((volatile unsigned int*)(0x42D00900UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP1        *((volatile unsigned int*)(0x42D00904UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP2        *((volatile unsigned int*)(0x42D00908UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP3        *((volatile unsigned int*)(0x42D0090CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP4        *((volatile unsigned int*)(0x42D00910UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP5        *((volatile unsigned int*)(0x42D00914UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP6        *((volatile unsigned int*)(0x42D00918UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP7        *((volatile unsigned int*)(0x42D0091CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP8        *((volatile unsigned int*)(0x42D00920UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP9        *((volatile unsigned int*)(0x42D00924UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP10       *((volatile unsigned int*)(0x42D00928UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP11       *((volatile unsigned int*)(0x42D0092CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP12       *((volatile unsigned int*)(0x42D00930UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP13       *((volatile unsigned int*)(0x42D00934UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP14       *((volatile unsigned int*)(0x42D00938UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP15       *((volatile unsigned int*)(0x42D0093CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP16       *((volatile unsigned int*)(0x42D00940UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP17       *((volatile unsigned int*)(0x42D00944UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP18       *((volatile unsigned int*)(0x42D00948UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP19       *((volatile unsigned int*)(0x42D0094CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP20       *((volatile unsigned int*)(0x42D00950UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP21       *((volatile unsigned int*)(0x42D00954UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP22       *((volatile unsigned int*)(0x42D00958UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP23       *((volatile unsigned int*)(0x42D0095CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP24       *((volatile unsigned int*)(0x42D00960UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP25       *((volatile unsigned int*)(0x42D00964UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP26       *((volatile unsigned int*)(0x42D00968UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP27       *((volatile unsigned int*)(0x42D0096CUL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP28       *((volatile unsigned int*)(0x42D00970UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP29       *((volatile unsigned int*)(0x42D00974UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP30       *((volatile unsigned int*)(0x42D00978UL))
#define bFM3_ETHERNET_MAC1_CHTDR_HTDAP31       *((volatile unsigned int*)(0x42D0097CUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP0        *((volatile unsigned int*)(0x42D00980UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP1        *((volatile unsigned int*)(0x42D00984UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP2        *((volatile unsigned int*)(0x42D00988UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP3        *((volatile unsigned int*)(0x42D0098CUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP4        *((volatile unsigned int*)(0x42D00990UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP5        *((volatile unsigned int*)(0x42D00994UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP6        *((volatile unsigned int*)(0x42D00998UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP7        *((volatile unsigned int*)(0x42D0099CUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP8        *((volatile unsigned int*)(0x42D009A0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP9        *((volatile unsigned int*)(0x42D009A4UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP10       *((volatile unsigned int*)(0x42D009A8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP11       *((volatile unsigned int*)(0x42D009ACUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP12       *((volatile unsigned int*)(0x42D009B0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP13       *((volatile unsigned int*)(0x42D009B4UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP14       *((volatile unsigned int*)(0x42D009B8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP15       *((volatile unsigned int*)(0x42D009BCUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP16       *((volatile unsigned int*)(0x42D009C0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP17       *((volatile unsigned int*)(0x42D009C4UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP18       *((volatile unsigned int*)(0x42D009C8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP19       *((volatile unsigned int*)(0x42D009CCUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP20       *((volatile unsigned int*)(0x42D009D0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP21       *((volatile unsigned int*)(0x42D009D4UL))
