RT-Thread/rt-thread/bsp/fujitsu/mb9x/mb9bf618s/CMSIS/DeviceSupport/fujitsu/mb9bf61x/mb9b610t.h
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP22       *((volatile unsigned int*)(0x42D009D8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP23       *((volatile unsigned int*)(0x42D009DCUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP24       *((volatile unsigned int*)(0x42D009E0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP25       *((volatile unsigned int*)(0x42D009E4UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP26       *((volatile unsigned int*)(0x42D009E8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP27       *((volatile unsigned int*)(0x42D009ECUL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP28       *((volatile unsigned int*)(0x42D009F0UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP29       *((volatile unsigned int*)(0x42D009F4UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP30       *((volatile unsigned int*)(0x42D009F8UL))
#define bFM3_ETHERNET_MAC1_CHRDR_HRDAP31       *((volatile unsigned int*)(0x42D009FCUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR0       *((volatile unsigned int*)(0x42D00A00UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR1       *((volatile unsigned int*)(0x42D00A04UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR2       *((volatile unsigned int*)(0x42D00A08UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR3       *((volatile unsigned int*)(0x42D00A0CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR4       *((volatile unsigned int*)(0x42D00A10UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR5       *((volatile unsigned int*)(0x42D00A14UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR6       *((volatile unsigned int*)(0x42D00A18UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR7       *((volatile unsigned int*)(0x42D00A1CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR8       *((volatile unsigned int*)(0x42D00A20UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR9       *((volatile unsigned int*)(0x42D00A24UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR10      *((volatile unsigned int*)(0x42D00A28UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR11      *((volatile unsigned int*)(0x42D00A2CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR12      *((volatile unsigned int*)(0x42D00A30UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR13      *((volatile unsigned int*)(0x42D00A34UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR14      *((volatile unsigned int*)(0x42D00A38UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR15      *((volatile unsigned int*)(0x42D00A3CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR16      *((volatile unsigned int*)(0x42D00A40UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR17      *((volatile unsigned int*)(0x42D00A44UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR18      *((volatile unsigned int*)(0x42D00A48UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR19      *((volatile unsigned int*)(0x42D00A4CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR20      *((volatile unsigned int*)(0x42D00A50UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR21      *((volatile unsigned int*)(0x42D00A54UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR22      *((volatile unsigned int*)(0x42D00A58UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR23      *((volatile unsigned int*)(0x42D00A5CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR24      *((volatile unsigned int*)(0x42D00A60UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR25      *((volatile unsigned int*)(0x42D00A64UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR26      *((volatile unsigned int*)(0x42D00A68UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR27      *((volatile unsigned int*)(0x42D00A6CUL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR28      *((volatile unsigned int*)(0x42D00A70UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR29      *((volatile unsigned int*)(0x42D00A74UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR30      *((volatile unsigned int*)(0x42D00A78UL))
#define bFM3_ETHERNET_MAC1_CHTBAR_HTBAR31      *((volatile unsigned int*)(0x42D00A7CUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR0       *((volatile unsigned int*)(0x42D00A80UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR1       *((volatile unsigned int*)(0x42D00A84UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR2       *((volatile unsigned int*)(0x42D00A88UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR3       *((volatile unsigned int*)(0x42D00A8CUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR4       *((volatile unsigned int*)(0x42D00A90UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR5       *((volatile unsigned int*)(0x42D00A94UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR6       *((volatile unsigned int*)(0x42D00A98UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR7       *((volatile unsigned int*)(0x42D00A9CUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR8       *((volatile unsigned int*)(0x42D00AA0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR9       *((volatile unsigned int*)(0x42D00AA4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR10      *((volatile unsigned int*)(0x42D00AA8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR11      *((volatile unsigned int*)(0x42D00AACUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR12      *((volatile unsigned int*)(0x42D00AB0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR13      *((volatile unsigned int*)(0x42D00AB4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR14      *((volatile unsigned int*)(0x42D00AB8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR15      *((volatile unsigned int*)(0x42D00ABCUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR16      *((volatile unsigned int*)(0x42D00AC0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR17      *((volatile unsigned int*)(0x42D00AC4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR18      *((volatile unsigned int*)(0x42D00AC8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR19      *((volatile unsigned int*)(0x42D00ACCUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR20      *((volatile unsigned int*)(0x42D00AD0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR21      *((volatile unsigned int*)(0x42D00AD4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR22      *((volatile unsigned int*)(0x42D00AD8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR23      *((volatile unsigned int*)(0x42D00ADCUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR24      *((volatile unsigned int*)(0x42D00AE0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR25      *((volatile unsigned int*)(0x42D00AE4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR26      *((volatile unsigned int*)(0x42D00AE8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR27      *((volatile unsigned int*)(0x42D00AECUL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR28      *((volatile unsigned int*)(0x42D00AF0UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR29      *((volatile unsigned int*)(0x42D00AF4UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR30      *((volatile unsigned int*)(0x42D00AF8UL))
#define bFM3_ETHERNET_MAC1_CHRBAR_HRBAR31      *((volatile unsigned int*)(0x42D00AFCUL))

#ifdef __cplusplus
}
#endif

#endif /* _MB9B610T_H_ */

